{
  "url": "https://fse.ewubd.edu/computer-science-engineering/undergraduate-programs",
  "program_name": "B. Sc. in Computer Science and Engineering",
  "vision_statement": "To be internationally renowned in Computer Science and Engineering and to exalt excellence in education, research, industrial profession, and entrepreneurship for sustainable transformation of the society.",
  "mission_statement": [],
  "peo": {},
  "peo_description": "Graduates of the B. Sc. in CSE program are expected to attain the following Program Educational Objectives (PEO) within few years, such as 3-5 years, of graduation.",
  "po": {
    "PO1": {
      "title": "Engineering Knowledge Apply knowledge of mathematics, natural sciences, engineering fundamentals and an engineering specialization as specified in K1 to K4 respectively to the solution of complex computer science and engineering problems (EP1 to EP7). PO2: Problem Analysis Identify, formulate, research literature and analyze complex computer science and engineering problems (EP1 to EP7) reaching substantiated conclusions using first principles of mathematics, natural sciences and engineering sciences. (K1 to K4) PO3: Design/ Development of Solutions Design solutions for complex computer science and engineering problems (EP1 to EP7) and design systems, components or processes that meet specified needs with appropriate consideration for public health and safety, cultural, societal, and environmental considerations. (K5) PO4: Investigation Conduct investigations of complex computer science and engineering problems (EP1 to EP7) using research-based knowledge (K8) and research methods including design of experiments, analysis and interpretation of data, and synthesis of information to provide valid conclusions. PO5: Modern Tool Usage Create, select and apply appropriate techniques, resources, and modern engineering and IT tools, including prediction and modeling, to complex computer science and engineering problems (EP1 to EP7), with an understanding of the limitations. (K6) PO6: The Engineer and Society Apply reasoning informed by contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to professional computer science and engineering practice and solutions to complex computer science and engineering problems (EP1 to EP7). (K7) PO7: Environment and Sustainability Understand and evaluate the sustainability and impact of professional computer science and engineering work in the solution of complex computer science and engineering problems (EP1 to EP7) in societal and environmental contexts. (K7) PO8: Ethics Apply ethical principles and commit to professional ethics and responsibilities and norms of computer science and engineering practice. (K7) PO9: Individual Work and Teamwork Function effectively as an individual, and as a member or leader in diverse teams and in multi-disciplinary settings. PO10: Communication Communicate effectively on complex computer science and engineering activities (EA1 to EA5) with the computer science and engineering community and with society at large, such as being able to comprehend and write effective reports and design documentation, make effective presentations, and give and receive clear instructions. PO11: Project Management and Finance Demonstrate knowledge and understanding of engineering management principles and economic decision-making and apply these to one’s own work, as a member and leader in a team, to manage projects and in multidisciplinary environments. PO12: Life-Long Learning Recognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change. Mapping of Program Outcomes (POs) to Program Educational Objectives (PEOs) Program Outcomes (POs) Program Educational Objectives (PEOs) PEO1 PEO2 PEO3 PO1: Engineering Knowledge X PO2: Problem Analysis X PO3: Design/Development of Solutions X PO4: Investigation X PO5: Modern Tool Usage X PO6: The Engineer and Society X PO7: Environment and Sustainability X PO8: Ethics X PO9: Individual Work and Teamwork X PO10: Communication X PO11: Project Management and Finance X PO12: Life-Long Learning X Knowledge Profile The B. Sc. in CSE curriculum must encompasses all the elements of the knowledge profile to achieve the program outcomes PO1 to PO8. Knowledge Profile Attribute K1: Theory-based natural sciences A systematic, theory-based understanding of the natural sciences applicable to the discipline K2: Conceptually-based mathematics, numerical analysis, statistics, and formal aspects of computer and information science Conceptually based mathematics, numerical analysis, statistics and the formal aspects of computer and information science to support analysis and modeling applicable to the discipline K3: Theory-based engineering fundamentals A systematic, theory-based formulation of engineering fundamentals required in the engineering discipline K4: Forefront engineering specialist knowledge for practice Engineering specialist knowledge that provides theoretical frameworks and bodies of knowledge for the accepted practice areas in the engineering discipline; much is at the forefront of the discipline K5: Engineering design Knowledge that supports engineering design in a practice area K6: Engineering practice (technology) Knowledge of engineering practice (technology) in the practice areas in the engineering discipline K7: Comprehension of engineering in society Comprehension of the role of engineering in society and identified issues in engineering practice in the discipline: ethics and the engineer’s professional responsibility to public safety; the impacts of engineering activity; economic, social, cultural, environmental and sustainability K8: Research literature Engagement with selected knowledge in the research literature of the discipline Range of Complex Engineering Problem Solving Complex engineering problem solving as required in PO1, PO2, PO3, PO4, PO5, PO6, and PO7 are problems that have EP1 and some or all of EP2 to EP7 characteristics. Attribute Characteristics of Complex Engineering Problems EP1: Depth of knowledge required Cannot be resolved without in-depth engineering knowledge at the level of one or more of K3, K4, K5, K6, or K8 which allows a fundamental-based, first principles analytical approach EP2: Range of conflicting requirements Involve wide-ranging or conflicting technical, engineering and other issues EP3: Depth of analysis required Have no obvious solution and require abstract thinking, originality in analysis to formulate suitable models EP4: Familiarity of issues Involve infrequently encountered issues EP5: Extent of applicable codes Are outside problems encompassed by standards and codes of practice for professional engineering EP 6: Extent of stakeholder involvement and conflicting requirements Involve diverse groups of stakeholders with widely varying needs EP7: Interdependence Are high level problems including many component parts or sub-problems Range of Complex Engineering Activities Complex engineering activities as required in PO10 are engineering activities or projects that have some or all of EA1 to EA5 characteristics. Attribute Characteristics of Complex Engineering Activities EA1: Range of resources Involve the use of diverse resources (for this purpose, resources include people, money, equipment, materials, information and technologies) EA2: Level of interaction Require resolution of significant problems arising from interactions between wide-ranging or conflicting technical, engineering or other issues EA3: Innovation Involve creative use of engineering principles and research-based knowledge in novel ways EA4: Consequences for society and the environment Have significant consequences in a range of contexts, characterized by difficulty of prediction and mitigation EA5: Familiarity Can extend beyond previous experiences by applying principle-based approaches Course Summary Course Category Credits Compulsory Language and General Education Courses 9 Elective General Education Courses 9 Compulsory Basic Science Courses 11 Compulsory Mathematics and Statistics Courses 15 Core Computer Science and Engineering Courses 62 Core Capstone Project 6 Major Compulsory and Elective Computer Science and Engineering Courses 20 Non-major Elective Computer Science and Engineering Courses 8 Total 140 List of Courses Course Credits Prerequisite Compulsory Language and General Education Courses 9 ENG101 Basic English 3 ENG 102 Composition and Communication Skills 3 ENG101 GEN226 Emergence of Bangladesh 3 ENG102 Elective General Education Courses 9 Social Science Courses (any one course) 3 ECO101 Principle of Microeconomics 3 None GEN203 Ecological System and Environment 3 None GEN214 Development Studies 3 ENG102 SOC317 Sociology of Science and Technology 3 None Arts and Humanities Courses (any one course) 3 GEN201 Bangladesh Studies 3 ENG102 GEN204 Western Thought 3 None GEN210 International Relation 3 ENG102 SOC211 Eastern Culture and Heritage 3 None SOC217 Religion, Ethnicity, Culture and Development in South Asia 3 ENG102 Business Courses (any one course) 3 ACT101 Financial Accounting 3 None BUS321 Business for Engineering and Technology 3 ENG102 BUS231 Business Communication 3 ENG102 MGT321 Industrial Management 3 ENG102 MGT337 Production Operations Management 3 STA102 FIN101 Principle of Finance 3 STA102 MKT101 Principle of Marketing 3 None Compulsory Natural Science Courses 9+2=11 PHY109 Engineering Physics-I (Introductory Classical Physics) 3+1=4 MAT102 PHY209 Engineering Physics-II (Introductory Quantum Physics) 3+0=3 MAT205 CHE109 Engineering Chemistry 3+1=4 Compulsory Mathematics and Statistics Courses 15 MAT101 Differential and Integral Calculus 3 MAT102 Differential Equations and Special Functions 3 MAT101 MAT104 Coordinate Geometry and Vector Analysis 3 MAT101 MAT205 Linear Algebra and Complex Variable 3 MAT102 STA102 Statistics and Probability 3 Core Computer Science and Engineering Courses 48+14=62 CSE103 Structured Programming 3+1.5=4.5 CSE106 Discrete Mathematics 3+0=3 CSE103 CSE110 Object Oriented Programming 3+1.5=4.5 CSE106 CSE200 Computer-Aided Engineering Drawing 0+1=1 CSE209 Electrical Circuits 3+1=4 CSE207 Data Structures 3+1=4 CSE110 CSE251 Electronic Circuits 3+1=4 CSE209 CSE246 Algorithms 3+1.5=4.5 CSE207 CSE302 Database Systems 3+1.5=4.5 CSE106 CSE325 Operating Systems 3+1=4 CSE207 CSE345 Digital Logic Design 3+1=4 CSE251 CSE347 Information System Analysis and Design 3+1=4 CSE302 CSE360 Computer Architecture 3+0=3 CSE325 CSE405 Computer Networks 3+1=4 CSE246 CSE407 Green Computing 3+0=3 CSE405 CSE487 Cyber Security, Ethics and Law 3+0=3 CSE405 CSE495 IT Project Management and Entrepreneurship 3+0=3 CSE347 Core Capstone Project 0+6=6 CSE400 Capstone Project 0+6=6 Completed at least 105 credit hours Major Requirements Courses from the selected major area Student should select one of the four major areas for degree major requirement Two Compulsory courses (6+2=8 credits) Three elective courses (9+3=12 credits) Non-Major Elective Requirements Minimum 8 credits ( two to three courses depending on credits of the courses) from one or more major/non-major areas other than the selected major area Four Major Areas and Courses (2 Compulsory and 3 Elective Courses) 15+5=20 1. Intelligent Systems and Data Science 15+5=20 Compulsory Courses 6+2=8 CSE303 Statistics for Data Science 3+1=4 STA102 CSE366 Artificial Intelligence 3+1=4 CSE246 Elective Courses (Any 3 Courses) 9+3=12 CSE420 Computer Graphics 3+1=4 CSE246 CSE438 Digital Image Processing 3+1=4 CSE246 CSE445 Computer Vision 3+1=4 CSE246 CSE452 Distributed Systems and Algorithms 3+1=4 CSE325 CSE474 Pattern Recognition 3+1=4 CSE366 CSE475 Machine Learning 3+1=4 CSE366 CSE477 Data Mining 3+1=4 CSE366 CSE481 Nature-Inspired Computing 3+1=4 CSE246 CSE486 Bioinformatics Algorithms 3+1=4 CSE246 CSE488 Big Data Analytics 3+1=4 CSE302 2. Software Engineering 15+5=20 Compulsory Courses 6+2=8 CSE412 Software Engineering 3+1=4 CSE347 CSE430 Software Testing and Quality Assurance 3+1=4 CSE412 Elective Courses (Any 3 Courses) 9+3=12 CSE422 Simulation and Modeling 3+1=4 CSE246 CSE423 Software Architecture 3+1=4 CSE412 CSE428 Human Computer Interactions 3+1=4 CSE412 CSE452 Distributed Systems and Algorithms 3+1=4 CSE325 CSE464 Advanced Database System 3+1=4 CSE302 CSE479 Web Programming 3+1=4 CSE302 CSE489 Mobile Programming 3+1=4 CSE246 3. Communications and Networking 15+5=20 Compulsory Courses 6+2=8 CSE350 Data Communications 3+1=4 CSE251 CSE432 Digital Signal Processing 3+1=4 CSE246 Elective Courses (Any 3 Courses) 9+3=12 CSE452 Distributed Systems and Algorithms 3+1=4 CSE325 CSE453Wireless Networks 3+1=4 CSE405 CSE457 Cellular Networks 3+1=4 CSE405 CSE472 Advanced Network Services and Management 3+1=4 CSE405 CSE473 Network Security and Systems 3+1=4 CSE405 CSE489 Mobile Programming 3+1=4 CSE246 4. Hardware Engineering 15+5=20 Compulsory Courses 6+2=8 CSE355 Digital System Design 3+1=4 CSE345 CSE442 Microprocessors and Microcontrollers 3+1=4 CSE360 Elective Courses (Any 3 Courses) 9+3=12 CSE406 Internet of Things 3+1=4 CSE405 CSE446 ASIC Design Using FPGA 3+1=4 CSE345 CSE491 VLSI Design 3+1=4 CSE345 CSE492 Robotics 3+1=4 CSE366 CSE494 Embedded Systems 3+1=4 CSE442 Non-Major Area: Computational Theory CSE225 Numerical Methods 3+1=4 CSE103 CSE313 Theory of Computations 3+0=3 CSE246 CSE460 Cryptography 3+0=3 CSE246 CSE471 Compiler Design 3+1=4 CSE246 CSE483 Graph Theory 3+0=3 CSE246 CSE484 Computational Geometry 3+0=3 CSE246 Note: Course to PO mapping is under revision. Course Flowchart 1st Year 2nd Year 3rd Year 4th Year Course (Credit) Pre-requisite Course Pre-requisite Course Pre-requisite Course Pre-requisite 1st Semester ENG101 Basic English (3) GEN226 Emergence of Bangladesh (3) ENG102 Elective General Education-III (3) CSE400 Capstone Project-I (0+1=1) MAT101 Differential and Integral Calculus (3) STA102 Statistics and Probability (3) CSE246 Algorithms (3+1.5=4.5) CSE207 CSE407 Green Computing (3+0=3) CSE405 CSE103 Structured Programming (3+1.5=4.5) CSE200 Computer-Aided Engineering Drawing (0+1=1) CSE302 Database Systems (3+1.5=4.5) CSE106 Elective Major-I (3+1=4) CSE209 Electrical Circuits (3+1=4) Elective Non-Major-I (3+1=4) 2nd Semester ENG102 Composition And Communication Skills (3) ENG101 Elective General Education-I (3) CSE345 Digital Logic Design (3+1=4) CSE251 CSE400 Capstone Project-II (0+2=2) MAT102 Differential Equations and Special Functions (3) MAT101 MAT205 Linear Algebra and Complex Variables (3) MAT102 CSE347 Information System Analysis and Design (3+1=4) CSE302 CSE487 Cyber Security, Ethics and Law (3+0=3) CSE405 CSE106 Discrete Mathematics (3+0=3) CSE103 CSE207 Data Structures (3+1=4) CSE110 Compulsory Major-I (3+1=4) Elective Major-II (3+1=4) CHE109 Engineering Chemistry (3+1=4) CSE251 Electronic Circuits (3+1=4) CSE209 Elective Non-Major-II (3+1=4) 3rd Semester PHY109 Engineering Physics-I (3+1=4) MAT102 Elective General Education-II (3) CSE360 Computer Architecture (3+0=3) CSE325 CSE400 Capstone Project-III (0+3=3) MAT104 Coordinate Geometry and Vector Analysis (3) MAT101 PHY209 Engineering Physics-II (3+0=3) MAT205 CSE 405 Computer Networks (3+1=4) CSE246 CSE495 IT Project Management and Entrepreneurship (3+0=3) CSE347 CSE110 Object Oriented Programming (3+1.5=4.5) CSE106 CSE325 Operating Systems (3+1=4) CSE207 Compulsory Major-II (3+1=4) Elective Major-III (3+1=4) Year-Credit 35 35 35 35 Department of Computer Science & Engineering Faculty Member Undergraduate Programs Graduate Programs Tuition Fees Publications Research Area Lab Facilities Administrative Officials News Notices Events Achievements Contact Us Your Bright Future is Our Mission Click to Apply Online Apply Now Department Office A/2, Jahurul Islam Avenue Jahurul Islam City, Aftabnagar Dhaka-1212, Bangladesh 09666775577",
      "description": "Ext. – 206 cse@ewubd.edu Student Academic Calendar Campus Life Payment Procedure Convocation Rules & Regulation Faculty Search Grading Policy University Directory Proctor Schedule E-Tender Procurement Gallery Journal and Publications Archives Quick Links Apply Online Jobs at EWU Degree Verification Contact Us Location Map Developed and maintained by ICS, EWU Copyright@ 2025 East West University 191,311,198 Total view, 23,927,878 Views Today Top"
    }
  },
  "po_description": "Graduates of the B. Sc. in CSE program are expected to attain the following Program Outcomes (POs) by the time of graduation. PO Description PO1: Engineering Knowledge Apply knowledge of mathematics, natural sciences, engineering fundamentals and an engineering specialization as specified in K1 to K4 respectively to the solution of complex computer science and engineering problems (EP1 to EP7). PO2: Problem Analysis Identify, formulate, research literature and analyze complex computer science and engineering problems (EP1 to EP7) reaching substantiated conclusions using first principles of mathematics, natural sciences and engineering sciences. (K1 to K4) PO3: Design/ Development of Solutions Design solutions for complex computer science and engineering problems (EP1 to EP7) and design systems, components or processes that meet specified needs with appropriate consideration for public health and safety, cultural, societal, and environmental considerations. (K5) PO4: Investigation Conduct investigations of complex computer science and engineering problems (EP1 to EP7) using research-based knowledge (K8) and research methods including design of experiments, analysis and interpretation of data, and synthesis of information to provide valid conclusions. PO5: Modern Tool Usage Create, select and apply appropriate techniques, resources, and modern engineering and IT tools, including prediction and modeling, to complex computer science and engineering problems (EP1 to EP7), with an understanding of the limitations. (K6) PO6: The Engineer and Society Apply reasoning informed by contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to professional computer science and engineering practice and solutions to complex computer science and engineering problems (EP1 to EP7). (K7) PO7: Environment and Sustainability Understand and evaluate the sustainability and impact of professional computer science and engineering work in the solution of complex computer science and engineering problems (EP1 to EP7) in societal and environmental contexts. (K7) PO8: Ethics Apply ethical principles and commit to professional ethics and responsibilities and norms of computer science and engineering practice. (K7) PO9: Individual Work and Teamwork Function effectively as an individual, and as a member or leader in diverse teams and in multi-disciplinary settings. PO10: Communication Communicate effectively on complex computer science and engineering activities (EA1 to EA5) with the computer science and engineering community and with society at large, such as being able to comprehend and write effective reports and design documentation, make effective presentations, and give and receive clear instructions. PO11: Project Management and Finance Demonstrate knowledge and understanding of engineering management principles and economic decision-making and apply these to one’s own work, as a member and leader in a team, to manage projects and in multidisciplinary environments. PO12: Life-Long Learning Recognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change. Mapping of Program Outcomes (POs) to Program Educational Objectives (PEOs) Program Outcomes (POs) Program Educational Objectives (PEOs) PEO1 PEO2 PEO3 PO1: Engineering Knowledge X PO2: Problem Analysis X PO3: Design/Development of Solutions X PO4: Investigation X PO5: Modern Tool Usage X PO6: The Engineer and Society X PO7: Environment and Sustainability X PO8: Ethics X PO9: Individual Work and Teamwork X PO10: Communication X PO11: Project Management and Finance X PO12: Life-Long Learning X Knowledge Profile The B. Sc. in CSE curriculum must encompasses all the elements of the knowledge profile to achieve the program outcomes PO1 to PO8. Knowledge Profile Attribute K1: Theory-based natural sciences A systematic, theory-based understanding of the natural sciences applicable to the discipline K2: Conceptually-based mathematics, numerical analysis, statistics, and formal aspects of computer and information science Conceptually based mathematics, numerical analysis, statistics and the formal aspects of computer and information science to support analysis and modeling applicable to the discipline K3: Theory-based engineering fundamentals A systematic, theory-based formulation of engineering fundamentals required in the engineering discipline K4: Forefront engineering specialist knowledge for practice Engineering specialist knowledge that provides theoretical frameworks and bodies of knowledge for the accepted practice areas in the engineering discipline; much is at the forefront of the discipline K5: Engineering design Knowledge that supports engineering design in a practice area K6: Engineering practice (technology) Knowledge of engineering practice (technology) in the practice areas in the engineering discipline K7: Comprehension of engineering in society Comprehension of the role of engineering in society and identified issues in engineering practice in the discipline: ethics and the engineer’s professional responsibility to public safety; the impacts of engineering activity; economic, social, cultural, environmental and sustainability K8: Research literature Engagement with selected knowledge in the research literature of the discipline Range of Complex Engineering Problem Solving Complex engineering problem solving as required in PO1, PO2, PO3, PO4, PO5, PO6, and PO7 are problems that have EP1 and some or all of EP2 to EP7 characteristics. Attribute Characteristics of Complex Engineering Problems EP1: Depth of knowledge required Cannot be resolved without in-depth engineering knowledge at the level of one or more of K3, K4, K5, K6, or K8 which allows a fundamental-based, first principles analytical approach EP2: Range of conflicting requirements Involve wide-ranging or conflicting technical, engineering and other issues EP3: Depth of analysis required Have no obvious solution and require abstract thinking, originality in analysis to formulate suitable models EP4: Familiarity of issues Involve infrequently encountered issues EP5: Extent of applicable codes Are outside problems encompassed by standards and codes of practice for professional engineering EP 6: Extent of stakeholder involvement and conflicting requirements Involve diverse groups of stakeholders with widely varying needs EP7: Interdependence Are high level problems including many component parts or sub-problems Range of Complex Engineering Activities Complex engineering activities as required in PO10 are engineering activities or projects that have some or all of EA1 to EA5 characteristics. Attribute Characteristics of Complex Engineering Activities EA1: Range of resources Involve the use of diverse resources (for this purpose, resources include people, money, equipment, materials, information and technologies) EA2: Level of interaction Require resolution of significant problems arising from interactions between wide-ranging or conflicting technical, engineering or other issues EA3: Innovation Involve creative use of engineering principles and research-based knowledge in novel ways EA4: Consequences for society and the environment Have significant consequences in a range of contexts, characterized by difficulty of prediction and mitigation EA5: Familiarity Can extend beyond previous experiences by applying principle-based approaches Course Summary Course Category Credits Compulsory Language and General Education Courses 9 Elective General Education Courses 9 Compulsory Basic Science Courses 11 Compulsory Mathematics and Statistics Courses 15 Core Computer Science and Engineering Courses 62 Core Capstone Project 6 Major Compulsory and Elective Computer Science and Engineering Courses 20 Non-major Elective Computer Science and Engineering Courses 8 Total 140 List of Courses Course Credits Prerequisite Compulsory Language and General Education Courses 9 ENG101 Basic English 3 ENG 102 Composition and Communication Skills 3 ENG101 GEN226 Emergence of Bangladesh 3 ENG102 Elective General Education Courses 9 Social Science Courses (any one course) 3 ECO101 Principle of Microeconomics 3 None GEN203 Ecological System and Environment 3 None GEN214 Development Studies 3 ENG102 SOC317 Sociology of Science and Technology 3 None Arts and Humanities Courses (any one course) 3 GEN201 Bangladesh Studies 3 ENG102 GEN204 Western Thought 3 None GEN210 International Relation 3 ENG102 SOC211 Eastern Culture and Heritage 3 None SOC217 Religion, Ethnicity, Culture and Development in South Asia 3 ENG102 Business Courses (any one course) 3 ACT101 Financial Accounting 3 None BUS321 Business for Engineering and Technology 3 ENG102 BUS231 Business Communication 3 ENG102 MGT321 Industrial Management 3 ENG102 MGT337 Production Operations Management 3 STA102 FIN101 Principle of Finance 3 STA102 MKT101 Principle of Marketing 3 None Compulsory Natural Science Courses 9+2=11 PHY109 Engineering Physics-I (Introductory Classical Physics) 3+1=4 MAT102 PHY209 Engineering Physics-II (Introductory Quantum Physics) 3+0=3 MAT205 CHE109 Engineering Chemistry 3+1=4 Compulsory Mathematics and Statistics Courses 15 MAT101 Differential and Integral Calculus 3 MAT102 Differential Equations and Special Functions 3 MAT101 MAT104 Coordinate Geometry and Vector Analysis 3 MAT101 MAT205 Linear Algebra and Complex Variable 3 MAT102 STA102 Statistics and Probability 3 Core Computer Science and Engineering Courses 48+14=62 CSE103 Structured Programming 3+1.5=4.5 CSE106 Discrete Mathematics 3+0=3 CSE103 CSE110 Object Oriented Programming 3+1.5=4.5 CSE106 CSE200 Computer-Aided Engineering Drawing 0+1=1 CSE209 Electrical Circuits 3+1=4 CSE207 Data Structures 3+1=4 CSE110 CSE251 Electronic Circuits 3+1=4 CSE209 CSE246 Algorithms 3+1.5=4.5 CSE207 CSE302 Database Systems 3+1.5=4.5 CSE106 CSE325 Operating Systems 3+1=4 CSE207 CSE345 Digital Logic Design 3+1=4 CSE251 CSE347 Information System Analysis and Design 3+1=4 CSE302 CSE360 Computer Architecture 3+0=3 CSE325 CSE405 Computer Networks 3+1=4 CSE246 CSE407 Green Computing 3+0=3 CSE405 CSE487 Cyber Security, Ethics and Law 3+0=3 CSE405 CSE495 IT Project Management and Entrepreneurship 3+0=3 CSE347 Core Capstone Project 0+6=6 CSE400 Capstone Project 0+6=6 Completed at least 105 credit hours Major Requirements Courses from the selected major area Student should select one of the four major areas for degree major requirement Two Compulsory courses (6+2=8 credits) Three elective courses (9+3=12 credits) Non-Major Elective Requirements Minimum 8 credits ( two to three courses depending on credits of the courses) from one or more major/non-major areas other than the selected major area Four Major Areas and Courses (2 Compulsory and 3 Elective Courses) 15+5=20 1. Intelligent Systems and Data Science 15+5=20 Compulsory Courses 6+2=8 CSE303 Statistics for Data Science 3+1=4 STA102 CSE366 Artificial Intelligence 3+1=4 CSE246 Elective Courses (Any 3 Courses) 9+3=12 CSE420 Computer Graphics 3+1=4 CSE246 CSE438 Digital Image Processing 3+1=4 CSE246 CSE445 Computer Vision 3+1=4 CSE246 CSE452 Distributed Systems and Algorithms 3+1=4 CSE325 CSE474 Pattern Recognition 3+1=4 CSE366 CSE475 Machine Learning 3+1=4 CSE366 CSE477 Data Mining 3+1=4 CSE366 CSE481 Nature-Inspired Computing 3+1=4 CSE246 CSE486 Bioinformatics Algorithms 3+1=4 CSE246 CSE488 Big Data Analytics 3+1=4 CSE302 2. Software Engineering 15+5=20 Compulsory Courses 6+2=8 CSE412 Software Engineering 3+1=4 CSE347 CSE430 Software Testing and Quality Assurance 3+1=4 CSE412 Elective Courses (Any 3 Courses) 9+3=12 CSE422 Simulation and Modeling 3+1=4 CSE246 CSE423 Software Architecture 3+1=4 CSE412 CSE428 Human Computer Interactions 3+1=4 CSE412 CSE452 Distributed Systems and Algorithms 3+1=4 CSE325 CSE464 Advanced Database System 3+1=4 CSE302 CSE479 Web Programming 3+1=4 CSE302 CSE489 Mobile Programming 3+1=4 CSE246 3. Communications and Networking 15+5=20 Compulsory Courses 6+2=8 CSE350 Data Communications 3+1=4 CSE251 CSE432 Digital Signal Processing 3+1=4 CSE246 Elective Courses (Any 3 Courses) 9+3=12 CSE452 Distributed Systems and Algorithms 3+1=4 CSE325 CSE453Wireless Networks 3+1=4 CSE405 CSE457 Cellular Networks 3+1=4 CSE405 CSE472 Advanced Network Services and Management 3+1=4 CSE405 CSE473 Network Security and Systems 3+1=4 CSE405 CSE489 Mobile Programming 3+1=4 CSE246 4. Hardware Engineering 15+5=20 Compulsory Courses 6+2=8 CSE355 Digital System Design 3+1=4 CSE345 CSE442 Microprocessors and Microcontrollers 3+1=4 CSE360 Elective Courses (Any 3 Courses) 9+3=12 CSE406 Internet of Things 3+1=4 CSE405 CSE446 ASIC Design Using FPGA 3+1=4 CSE345 CSE491 VLSI Design 3+1=4 CSE345 CSE492 Robotics 3+1=4 CSE366 CSE494 Embedded Systems 3+1=4 CSE442 Non-Major Area: Computational Theory CSE225 Numerical Methods 3+1=4 CSE103 CSE313 Theory of Computations 3+0=3 CSE246 CSE460 Cryptography 3+0=3 CSE246 CSE471 Compiler Design 3+1=4 CSE246 CSE483 Graph Theory 3+0=3 CSE246 CSE484 Computational Geometry 3+0=3 CSE246 Note: Course to PO mapping is under revision. Course Flowchart 1st Year 2nd Year 3rd Year 4th Year Course (Credit) Pre-requisite Course Pre-requisite Course Pre-requisite Course Pre-requisite 1st Semester ENG101 Basic English (3) GEN226 Emergence of Bangladesh (3) ENG102 Elective General Education-III (3) CSE400 Capstone Project-I (0+1=1) MAT101 Differential and Integral Calculus (3) STA102 Statistics and Probability (3) CSE246 Algorithms (3+1.5=4.5) CSE207 CSE407 Green Computing (3+0=3) CSE405 CSE103 Structured Programming (3+1.5=4.5) CSE200 Computer-Aided Engineering Drawing (0+1=1) CSE302 Database Systems (3+1.5=4.5) CSE106 Elective Major-I (3+1=4) CSE209 Electrical Circuits (3+1=4) Elective Non-Major-I (3+1=4) 2nd Semester ENG102 Composition And Communication Skills (3) ENG101 Elective General Education-I (3) CSE345 Digital Logic Design (3+1=4) CSE251 CSE400 Capstone Project-II (0+2=2) MAT102 Differential Equations and Special Functions (3) MAT101 MAT205 Linear Algebra and Complex Variables (3) MAT102 CSE347 Information System Analysis and Design (3+1=4) CSE302 CSE487 Cyber Security, Ethics and Law (3+0=3) CSE405 CSE106 Discrete Mathematics (3+0=3) CSE103 CSE207 Data Structures (3+1=4) CSE110 Compulsory Major-I (3+1=4) Elective Major-II (3+1=4) CHE109 Engineering Chemistry (3+1=4) CSE251 Electronic Circuits (3+1=4) CSE209 Elective Non-Major-II (3+1=4) 3rd Semester PHY109 Engineering Physics-I (3+1=4) MAT102 Elective General Education-II (3) CSE360 Computer Architecture (3+0=3) CSE325 CSE400 Capstone Project-III (0+3=3) MAT104 Coordinate Geometry and Vector Analysis (3) MAT101 PHY209 Engineering Physics-II (3+0=3) MAT205 CSE 405 Computer Networks (3+1=4) CSE246 CSE495 IT Project Management and Entrepreneurship (3+0=3) CSE347 CSE110 Object Oriented Programming (3+1.5=4.5) CSE106 CSE325 Operating Systems (3+1=4) CSE207 Compulsory Major-II (3+1=4) Elective Major-III (3+1=4) Year-Credit 35 35 35 35 Department of Computer Science & Engineering Faculty Member Undergraduate Programs Graduate Programs Tuition Fees Publications Research Area Lab Facilities Administrative Officials News Notices Events Achievements Contact Us Your Bright Future is Our Mission Click to Apply Online Apply Now Department Office A/2, Jahurul Islam Avenue Jahurul Islam City, Aftabnagar Dhaka-1212, Bangladesh 09666775577 | Ext. – 206 cse@ewubd.edu Student Academic Calendar Campus Life Payment Procedure Convocation Rules & Regulation Faculty Search Grading Policy University Directory Proctor Schedule E-Tender Procurement Gallery Journal and Publications Archives Quick Links Apply Online Jobs at EWU Degree Verification Contact Us Location Map Developed and maintained by ICS, EWU Copyright@ 2025 East West University 191,311,198 Total view, 23,927,878 Views Today Top",
  "po_to_peo_mapping": {},
  "knowledge_profile": {
    "K1": {
      "title": "Theory-based natural sciences A systematic, theory-based understanding of the natural sciences applicable to the discipline K2: Conceptually-based mathematics, numerical analysis, statistics, and formal aspects of computer and information science Conceptually based mathematics, numerical analysis, statistics and the formal aspects of computer and information science to support analysis and modeling applicable to the discipline K3: Theory-based engineering fundamentals A systematic, theory-based formulation of engineering fundamentals required in the engineering discipline K4: Forefront engineering specialist knowledge for practice Engineering specialist knowledge that provides theoretical frameworks and bodies of knowledge for the accepted practice areas in the engineering discipline; much is at the forefront of the discipline K5: Engineering design Knowledge that supports engineering design in a practice area K6: Engineering practice (technology) Knowledge of engineering practice (technology) in the practice areas in the engineering discipline K7: Comprehension of engineering in society Comprehension of the role of engineering in society and identified issues in engineering practice in the discipline: ethics and the engineer’s professional responsibility to public safety; the impacts of engineering activity; economic, social, cultural, environmental and sustainability K8: Research literature Engagement with selected knowledge in the research literature of the discipline Range of Complex Engineering Problem Solving Complex engineering problem solving as required in PO1, PO2, PO3, PO4, PO5, PO6, and PO7 are problems that have EP1 and some or all of EP2 to EP7 characteristics. Attribute Characteristics of Complex Engineering Problems EP1: Depth of knowledge required Cannot be resolved without in-depth engineering knowledge at the level of one or more of K3, K4, K5, K6, or K8 which allows a fundamental-based, first principles analytical approach EP2: Range of conflicting requirements Involve wide-ranging or conflicting technical, engineering and other issues EP3: Depth of analysis required Have no obvious solution and require abstract thinking, originality in analysis to formulate suitable models EP4: Familiarity of issues Involve infrequently encountered issues EP5: Extent of applicable codes Are outside problems encompassed by standards and codes of practice for professional engineering EP 6: Extent of stakeholder involvement and conflicting requirements Involve diverse groups of stakeholders with widely varying needs EP7: Interdependence Are high level problems including many component parts or sub-problems Range of Complex Engineering Activities Complex engineering activities as required in PO10 are engineering activities or projects that have some or all of EA1 to EA5 characteristics. Attribute Characteristics of Complex Engineering Activities EA1: Range of resources Involve the use of diverse resources (for this purpose, resources include people, money, equipment, materials, information and technologies) EA2: Level of interaction Require resolution of significant problems arising from interactions between wide-ranging or conflicting technical, engineering or other issues EA3: Innovation Involve creative use of engineering principles and research-based knowledge in novel ways EA4: Consequences for society and the environment Have significant consequences in a range of contexts, characterized by difficulty of prediction and mitigation EA5: Familiarity Can extend beyond previous experiences by applying principle-based approaches Course Summary Course Category Credits Compulsory Language and General Education Courses 9 Elective General Education Courses 9 Compulsory Basic Science Courses 11 Compulsory Mathematics and Statistics Courses 15 Core Computer Science and Engineering Courses 62 Core Capstone Project 6 Major Compulsory and Elective Computer Science and Engineering Courses 20 Non-major Elective Computer Science and Engineering Courses 8 Total 140 List of Courses Course Credits Prerequisite Compulsory Language and General Education Courses 9 ENG101 Basic English 3 ENG 102 Composition and Communication Skills 3 ENG101 GEN226 Emergence of Bangladesh 3 ENG102 Elective General Education Courses 9 Social Science Courses (any one course) 3 ECO101 Principle of Microeconomics 3 None GEN203 Ecological System and Environment 3 None GEN214 Development Studies 3 ENG102 SOC317 Sociology of Science and Technology 3 None Arts and Humanities Courses (any one course) 3 GEN201 Bangladesh Studies 3 ENG102 GEN204 Western Thought 3 None GEN210 International Relation 3 ENG102 SOC211 Eastern Culture and Heritage 3 None SOC217 Religion, Ethnicity, Culture and Development in South Asia 3 ENG102 Business Courses (any one course) 3 ACT101 Financial Accounting 3 None BUS321 Business for Engineering and Technology 3 ENG102 BUS231 Business Communication 3 ENG102 MGT321 Industrial Management 3 ENG102 MGT337 Production Operations Management 3 STA102 FIN101 Principle of Finance 3 STA102 MKT101 Principle of Marketing 3 None Compulsory Natural Science Courses 9+2=11 PHY109 Engineering Physics-I (Introductory Classical Physics) 3+1=4 MAT102 PHY209 Engineering Physics-II (Introductory Quantum Physics) 3+0=3 MAT205 CHE109 Engineering Chemistry 3+1=4 Compulsory Mathematics and Statistics Courses 15 MAT101 Differential and Integral Calculus 3 MAT102 Differential Equations and Special Functions 3 MAT101 MAT104 Coordinate Geometry and Vector Analysis 3 MAT101 MAT205 Linear Algebra and Complex Variable 3 MAT102 STA102 Statistics and Probability 3 Core Computer Science and Engineering Courses 48+14=62 CSE103 Structured Programming 3+1.5=4.5 CSE106 Discrete Mathematics 3+0=3 CSE103 CSE110 Object Oriented Programming 3+1.5=4.5 CSE106 CSE200 Computer-Aided Engineering Drawing 0+1=1 CSE209 Electrical Circuits 3+1=4 CSE207 Data Structures 3+1=4 CSE110 CSE251 Electronic Circuits 3+1=4 CSE209 CSE246 Algorithms 3+1.5=4.5 CSE207 CSE302 Database Systems 3+1.5=4.5 CSE106 CSE325 Operating Systems 3+1=4 CSE207 CSE345 Digital Logic Design 3+1=4 CSE251 CSE347 Information System Analysis and Design 3+1=4 CSE302 CSE360 Computer Architecture 3+0=3 CSE325 CSE405 Computer Networks 3+1=4 CSE246 CSE407 Green Computing 3+0=3 CSE405 CSE487 Cyber Security, Ethics and Law 3+0=3 CSE405 CSE495 IT Project Management and Entrepreneurship 3+0=3 CSE347 Core Capstone Project 0+6=6 CSE400 Capstone Project 0+6=6 Completed at least 105 credit hours Major Requirements Courses from the selected major area Student should select one of the four major areas for degree major requirement Two Compulsory courses (6+2=8 credits) Three elective courses (9+3=12 credits) Non-Major Elective Requirements Minimum 8 credits ( two to three courses depending on credits of the courses) from one or more major/non-major areas other than the selected major area Four Major Areas and Courses (2 Compulsory and 3 Elective Courses) 15+5=20 1. Intelligent Systems and Data Science 15+5=20 Compulsory Courses 6+2=8 CSE303 Statistics for Data Science 3+1=4 STA102 CSE366 Artificial Intelligence 3+1=4 CSE246 Elective Courses (Any 3 Courses) 9+3=12 CSE420 Computer Graphics 3+1=4 CSE246 CSE438 Digital Image Processing 3+1=4 CSE246 CSE445 Computer Vision 3+1=4 CSE246 CSE452 Distributed Systems and Algorithms 3+1=4 CSE325 CSE474 Pattern Recognition 3+1=4 CSE366 CSE475 Machine Learning 3+1=4 CSE366 CSE477 Data Mining 3+1=4 CSE366 CSE481 Nature-Inspired Computing 3+1=4 CSE246 CSE486 Bioinformatics Algorithms 3+1=4 CSE246 CSE488 Big Data Analytics 3+1=4 CSE302 2. Software Engineering 15+5=20 Compulsory Courses 6+2=8 CSE412 Software Engineering 3+1=4 CSE347 CSE430 Software Testing and Quality Assurance 3+1=4 CSE412 Elective Courses (Any 3 Courses) 9+3=12 CSE422 Simulation and Modeling 3+1=4 CSE246 CSE423 Software Architecture 3+1=4 CSE412 CSE428 Human Computer Interactions 3+1=4 CSE412 CSE452 Distributed Systems and Algorithms 3+1=4 CSE325 CSE464 Advanced Database System 3+1=4 CSE302 CSE479 Web Programming 3+1=4 CSE302 CSE489 Mobile Programming 3+1=4 CSE246 3. Communications and Networking 15+5=20 Compulsory Courses 6+2=8 CSE350 Data Communications 3+1=4 CSE251 CSE432 Digital Signal Processing 3+1=4 CSE246 Elective Courses (Any 3 Courses) 9+3=12 CSE452 Distributed Systems and Algorithms 3+1=4 CSE325 CSE453Wireless Networks 3+1=4 CSE405 CSE457 Cellular Networks 3+1=4 CSE405 CSE472 Advanced Network Services and Management 3+1=4 CSE405 CSE473 Network Security and Systems 3+1=4 CSE405 CSE489 Mobile Programming 3+1=4 CSE246 4. Hardware Engineering 15+5=20 Compulsory Courses 6+2=8 CSE355 Digital System Design 3+1=4 CSE345 CSE442 Microprocessors and Microcontrollers 3+1=4 CSE360 Elective Courses (Any 3 Courses) 9+3=12 CSE406 Internet of Things 3+1=4 CSE405 CSE446 ASIC Design Using FPGA 3+1=4 CSE345 CSE491 VLSI Design 3+1=4 CSE345 CSE492 Robotics 3+1=4 CSE366 CSE494 Embedded Systems 3+1=4 CSE442 Non-Major Area: Computational Theory CSE225 Numerical Methods 3+1=4 CSE103 CSE313 Theory of Computations 3+0=3 CSE246 CSE460 Cryptography 3+0=3 CSE246 CSE471 Compiler Design 3+1=4 CSE246 CSE483 Graph Theory 3+0=3 CSE246 CSE484 Computational Geometry 3+0=3 CSE246 Note: Course to PO mapping is under revision. Course Flowchart 1st Year 2nd Year 3rd Year 4th Year Course (Credit) Pre-requisite Course Pre-requisite Course Pre-requisite Course Pre-requisite 1st Semester ENG101 Basic English (3) GEN226 Emergence of Bangladesh (3) ENG102 Elective General Education-III (3) CSE400 Capstone Project-I (0+1=1) MAT101 Differential and Integral Calculus (3) STA102 Statistics and Probability (3) CSE246 Algorithms (3+1.5=4.5) CSE207 CSE407 Green Computing (3+0=3) CSE405 CSE103 Structured Programming (3+1.5=4.5) CSE200 Computer-Aided Engineering Drawing (0+1=1) CSE302 Database Systems (3+1.5=4.5) CSE106 Elective Major-I (3+1=4) CSE209 Electrical Circuits (3+1=4) Elective Non-Major-I (3+1=4) 2nd Semester ENG102 Composition And Communication Skills (3) ENG101 Elective General Education-I (3) CSE345 Digital Logic Design (3+1=4) CSE251 CSE400 Capstone Project-II (0+2=2) MAT102 Differential Equations and Special Functions (3) MAT101 MAT205 Linear Algebra and Complex Variables (3) MAT102 CSE347 Information System Analysis and Design (3+1=4) CSE302 CSE487 Cyber Security, Ethics and Law (3+0=3) CSE405 CSE106 Discrete Mathematics (3+0=3) CSE103 CSE207 Data Structures (3+1=4) CSE110 Compulsory Major-I (3+1=4) Elective Major-II (3+1=4) CHE109 Engineering Chemistry (3+1=4) CSE251 Electronic Circuits (3+1=4) CSE209 Elective Non-Major-II (3+1=4) 3rd Semester PHY109 Engineering Physics-I (3+1=4) MAT102 Elective General Education-II (3) CSE360 Computer Architecture (3+0=3) CSE325 CSE400 Capstone Project-III (0+3=3) MAT104 Coordinate Geometry and Vector Analysis (3) MAT101 PHY209 Engineering Physics-II (3+0=3) MAT205 CSE 405 Computer Networks (3+1=4) CSE246 CSE495 IT Project Management and Entrepreneurship (3+0=3) CSE347 CSE110 Object Oriented Programming (3+1.5=4.5) CSE106 CSE325 Operating Systems (3+1=4) CSE207 Compulsory Major-II (3+1=4) Elective Major-III (3+1=4) Year-Credit 35 35 35 35 Department of Computer Science & Engineering Faculty Member Undergraduate Programs Graduate Programs Tuition Fees Publications Research Area Lab Facilities Administrative Officials News Notices Events Achievements Contact Us Your Bright Future is Our Mission Click to Apply Online Apply Now Department Office A/2, Jahurul Islam Avenue Jahurul Islam City, Aftabnagar Dhaka-1212, Bangladesh 09666775577",
      "description": "Ext. – 206 cse@ewubd.edu Student Academic Calendar Campus Life Payment Procedure Convocation Rules & Regulation Faculty Search Grading Policy University Directory Proctor Schedule E-Tender Procurement Gallery Journal and Publications Archives Quick Links Apply Online Jobs at EWU Degree Verification Contact Us Location Map Developed and maintained by ICS, EWU Copyright@ 2025 East West University 191,311,198 Total view, 23,927,878 Views Today Top"
    }
  },
  "knowledge_profile_description": "The B. Sc. in CSE curriculum must encompasses all the elements of the knowledge profile to achieve the program outcomes PO1 to PO8. Knowledge Profile Attribute K1: Theory-based natural sciences A systematic, theory-based understanding of the natural sciences applicable to the discipline K2: Conceptually-based mathematics, numerical analysis, statistics, and formal aspects of computer and information science Conceptually based mathematics, numerical analysis, statistics and the formal aspects of computer and information science to support analysis and modeling applicable to the discipline K3: Theory-based engineering fundamentals A systematic, theory-based formulation of engineering fundamentals required in the engineering discipline K4: Forefront engineering specialist knowledge for practice Engineering specialist knowledge that provides theoretical frameworks and bodies of knowledge for the accepted practice areas in the engineering discipline; much is at the forefront of the discipline K5: Engineering design Knowledge that supports engineering design in a practice area K6: Engineering practice (technology) Knowledge of engineering practice (technology) in the practice areas in the engineering discipline K7: Comprehension of engineering in society Comprehension of the role of engineering in society and identified issues in engineering practice in the discipline: ethics and the engineer’s professional responsibility to public safety; the impacts of engineering activity; economic, social, cultural, environmental and sustainability K8: Research literature Engagement with selected knowledge in the research literature of the discipline Range of Complex Engineering Problem Solving Complex engineering problem solving as required in PO1, PO2, PO3, PO4, PO5, PO6, and PO7 are problems that have EP1 and some or all of EP2 to EP7 characteristics. Attribute Characteristics of Complex Engineering Problems EP1: Depth of knowledge required Cannot be resolved without in-depth engineering knowledge at the level of one or more of K3, K4, K5, K6, or K8 which allows a fundamental-based, first principles analytical approach EP2: Range of conflicting requirements Involve wide-ranging or conflicting technical, engineering and other issues EP3: Depth of analysis required Have no obvious solution and require abstract thinking, originality in analysis to formulate suitable models EP4: Familiarity of issues Involve infrequently encountered issues EP5: Extent of applicable codes Are outside problems encompassed by standards and codes of practice for professional engineering EP 6: Extent of stakeholder involvement and conflicting requirements Involve diverse groups of stakeholders with widely varying needs EP7: Interdependence Are high level problems including many component parts or sub-problems Range of Complex Engineering Activities Complex engineering activities as required in PO10 are engineering activities or projects that have some or all of EA1 to EA5 characteristics. Attribute Characteristics of Complex Engineering Activities EA1: Range of resources Involve the use of diverse resources (for this purpose, resources include people, money, equipment, materials, information and technologies) EA2: Level of interaction Require resolution of significant problems arising from interactions between wide-ranging or conflicting technical, engineering or other issues EA3: Innovation Involve creative use of engineering principles and research-based knowledge in novel ways EA4: Consequences for society and the environment Have significant consequences in a range of contexts, characterized by difficulty of prediction and mitigation EA5: Familiarity Can extend beyond previous experiences by applying principle-based approaches Course Summary Course Category Credits Compulsory Language and General Education Courses 9 Elective General Education Courses 9 Compulsory Basic Science Courses 11 Compulsory Mathematics and Statistics Courses 15 Core Computer Science and Engineering Courses 62 Core Capstone Project 6 Major Compulsory and Elective Computer Science and Engineering Courses 20 Non-major Elective Computer Science and Engineering Courses 8 Total 140 List of Courses Course Credits Prerequisite Compulsory Language and General Education Courses 9 ENG101 Basic English 3 ENG 102 Composition and Communication Skills 3 ENG101 GEN226 Emergence of Bangladesh 3 ENG102 Elective General Education Courses 9 Social Science Courses (any one course) 3 ECO101 Principle of Microeconomics 3 None GEN203 Ecological System and Environment 3 None GEN214 Development Studies 3 ENG102 SOC317 Sociology of Science and Technology 3 None Arts and Humanities Courses (any one course) 3 GEN201 Bangladesh Studies 3 ENG102 GEN204 Western Thought 3 None GEN210 International Relation 3 ENG102 SOC211 Eastern Culture and Heritage 3 None SOC217 Religion, Ethnicity, Culture and Development in South Asia 3 ENG102 Business Courses (any one course) 3 ACT101 Financial Accounting 3 None BUS321 Business for Engineering and Technology 3 ENG102 BUS231 Business Communication 3 ENG102 MGT321 Industrial Management 3 ENG102 MGT337 Production Operations Management 3 STA102 FIN101 Principle of Finance 3 STA102 MKT101 Principle of Marketing 3 None Compulsory Natural Science Courses 9+2=11 PHY109 Engineering Physics-I (Introductory Classical Physics) 3+1=4 MAT102 PHY209 Engineering Physics-II (Introductory Quantum Physics) 3+0=3 MAT205 CHE109 Engineering Chemistry 3+1=4 Compulsory Mathematics and Statistics Courses 15 MAT101 Differential and Integral Calculus 3 MAT102 Differential Equations and Special Functions 3 MAT101 MAT104 Coordinate Geometry and Vector Analysis 3 MAT101 MAT205 Linear Algebra and Complex Variable 3 MAT102 STA102 Statistics and Probability 3 Core Computer Science and Engineering Courses 48+14=62 CSE103 Structured Programming 3+1.5=4.5 CSE106 Discrete Mathematics 3+0=3 CSE103 CSE110 Object Oriented Programming 3+1.5=4.5 CSE106 CSE200 Computer-Aided Engineering Drawing 0+1=1 CSE209 Electrical Circuits 3+1=4 CSE207 Data Structures 3+1=4 CSE110 CSE251 Electronic Circuits 3+1=4 CSE209 CSE246 Algorithms 3+1.5=4.5 CSE207 CSE302 Database Systems 3+1.5=4.5 CSE106 CSE325 Operating Systems 3+1=4 CSE207 CSE345 Digital Logic Design 3+1=4 CSE251 CSE347 Information System Analysis and Design 3+1=4 CSE302 CSE360 Computer Architecture 3+0=3 CSE325 CSE405 Computer Networks 3+1=4 CSE246 CSE407 Green Computing 3+0=3 CSE405 CSE487 Cyber Security, Ethics and Law 3+0=3 CSE405 CSE495 IT Project Management and Entrepreneurship 3+0=3 CSE347 Core Capstone Project 0+6=6 CSE400 Capstone Project 0+6=6 Completed at least 105 credit hours Major Requirements Courses from the selected major area Student should select one of the four major areas for degree major requirement Two Compulsory courses (6+2=8 credits) Three elective courses (9+3=12 credits) Non-Major Elective Requirements Minimum 8 credits ( two to three courses depending on credits of the courses) from one or more major/non-major areas other than the selected major area Four Major Areas and Courses (2 Compulsory and 3 Elective Courses) 15+5=20 1. Intelligent Systems and Data Science 15+5=20 Compulsory Courses 6+2=8 CSE303 Statistics for Data Science 3+1=4 STA102 CSE366 Artificial Intelligence 3+1=4 CSE246 Elective Courses (Any 3 Courses) 9+3=12 CSE420 Computer Graphics 3+1=4 CSE246 CSE438 Digital Image Processing 3+1=4 CSE246 CSE445 Computer Vision 3+1=4 CSE246 CSE452 Distributed Systems and Algorithms 3+1=4 CSE325 CSE474 Pattern Recognition 3+1=4 CSE366 CSE475 Machine Learning 3+1=4 CSE366 CSE477 Data Mining 3+1=4 CSE366 CSE481 Nature-Inspired Computing 3+1=4 CSE246 CSE486 Bioinformatics Algorithms 3+1=4 CSE246 CSE488 Big Data Analytics 3+1=4 CSE302 2. Software Engineering 15+5=20 Compulsory Courses 6+2=8 CSE412 Software Engineering 3+1=4 CSE347 CSE430 Software Testing and Quality Assurance 3+1=4 CSE412 Elective Courses (Any 3 Courses) 9+3=12 CSE422 Simulation and Modeling 3+1=4 CSE246 CSE423 Software Architecture 3+1=4 CSE412 CSE428 Human Computer Interactions 3+1=4 CSE412 CSE452 Distributed Systems and Algorithms 3+1=4 CSE325 CSE464 Advanced Database System 3+1=4 CSE302 CSE479 Web Programming 3+1=4 CSE302 CSE489 Mobile Programming 3+1=4 CSE246 3. Communications and Networking 15+5=20 Compulsory Courses 6+2=8 CSE350 Data Communications 3+1=4 CSE251 CSE432 Digital Signal Processing 3+1=4 CSE246 Elective Courses (Any 3 Courses) 9+3=12 CSE452 Distributed Systems and Algorithms 3+1=4 CSE325 CSE453Wireless Networks 3+1=4 CSE405 CSE457 Cellular Networks 3+1=4 CSE405 CSE472 Advanced Network Services and Management 3+1=4 CSE405 CSE473 Network Security and Systems 3+1=4 CSE405 CSE489 Mobile Programming 3+1=4 CSE246 4. Hardware Engineering 15+5=20 Compulsory Courses 6+2=8 CSE355 Digital System Design 3+1=4 CSE345 CSE442 Microprocessors and Microcontrollers 3+1=4 CSE360 Elective Courses (Any 3 Courses) 9+3=12 CSE406 Internet of Things 3+1=4 CSE405 CSE446 ASIC Design Using FPGA 3+1=4 CSE345 CSE491 VLSI Design 3+1=4 CSE345 CSE492 Robotics 3+1=4 CSE366 CSE494 Embedded Systems 3+1=4 CSE442 Non-Major Area: Computational Theory CSE225 Numerical Methods 3+1=4 CSE103 CSE313 Theory of Computations 3+0=3 CSE246 CSE460 Cryptography 3+0=3 CSE246 CSE471 Compiler Design 3+1=4 CSE246 CSE483 Graph Theory 3+0=3 CSE246 CSE484 Computational Geometry 3+0=3 CSE246 Note: Course to PO mapping is under revision. Course Flowchart 1st Year 2nd Year 3rd Year 4th Year Course (Credit) Pre-requisite Course Pre-requisite Course Pre-requisite Course Pre-requisite 1st Semester ENG101 Basic English (3) GEN226 Emergence of Bangladesh (3) ENG102 Elective General Education-III (3) CSE400 Capstone Project-I (0+1=1) MAT101 Differential and Integral Calculus (3) STA102 Statistics and Probability (3) CSE246 Algorithms (3+1.5=4.5) CSE207 CSE407 Green Computing (3+0=3) CSE405 CSE103 Structured Programming (3+1.5=4.5) CSE200 Computer-Aided Engineering Drawing (0+1=1) CSE302 Database Systems (3+1.5=4.5) CSE106 Elective Major-I (3+1=4) CSE209 Electrical Circuits (3+1=4) Elective Non-Major-I (3+1=4) 2nd Semester ENG102 Composition And Communication Skills (3) ENG101 Elective General Education-I (3) CSE345 Digital Logic Design (3+1=4) CSE251 CSE400 Capstone Project-II (0+2=2) MAT102 Differential Equations and Special Functions (3) MAT101 MAT205 Linear Algebra and Complex Variables (3) MAT102 CSE347 Information System Analysis and Design (3+1=4) CSE302 CSE487 Cyber Security, Ethics and Law (3+0=3) CSE405 CSE106 Discrete Mathematics (3+0=3) CSE103 CSE207 Data Structures (3+1=4) CSE110 Compulsory Major-I (3+1=4) Elective Major-II (3+1=4) CHE109 Engineering Chemistry (3+1=4) CSE251 Electronic Circuits (3+1=4) CSE209 Elective Non-Major-II (3+1=4) 3rd Semester PHY109 Engineering Physics-I (3+1=4) MAT102 Elective General Education-II (3) CSE360 Computer Architecture (3+0=3) CSE325 CSE400 Capstone Project-III (0+3=3) MAT104 Coordinate Geometry and Vector Analysis (3) MAT101 PHY209 Engineering Physics-II (3+0=3) MAT205 CSE 405 Computer Networks (3+1=4) CSE246 CSE495 IT Project Management and Entrepreneurship (3+0=3) CSE347 CSE110 Object Oriented Programming (3+1.5=4.5) CSE106 CSE325 Operating Systems (3+1=4) CSE207 Compulsory Major-II (3+1=4) Elective Major-III (3+1=4) Year-Credit 35 35 35 35 Department of Computer Science & Engineering Faculty Member Undergraduate Programs Graduate Programs Tuition Fees Publications Research Area Lab Facilities Administrative Officials News Notices Events Achievements Contact Us Your Bright Future is Our Mission Click to Apply Online Apply Now Department Office A/2, Jahurul Islam Avenue Jahurul Islam City, Aftabnagar Dhaka-1212, Bangladesh 09666775577 | Ext. – 206 cse@ewubd.edu Student Academic Calendar Campus Life Payment Procedure Convocation Rules & Regulation Faculty Search Grading Policy University Directory Proctor Schedule E-Tender Procurement Gallery Journal and Publications Archives Quick Links Apply Online Jobs at EWU Degree Verification Contact Us Location Map Developed and maintained by ICS, EWU Copyright@ 2025 East West University 191,311,198 Total view, 23,927,878 Views Today Top",
  "complex_problem_solving": {
    "EP1": {
      "attribute": "Depth of knowledge required Cannot be resolved without in-depth engineering knowledge at the level of one or more of K3, K4, K5, K6, or K8 which allows a fundamental-based, first principles analytical approach EP2: Range of conflicting requirements Involve wide-ranging or conflicting technical, engineering and other issues EP3: Depth of analysis required Have no obvious solution and require abstract thinking, originality in analysis to formulate suitable models EP4: Familiarity of issues Involve infrequently encountered issues EP5: Extent of applicable codes Are outside problems encompassed by standards and codes of practice for professional engineering EP 6: Extent of stakeholder involvement and conflicting requirements Involve diverse groups of stakeholders with widely varying needs EP7: Interdependence Are high level problems including many component parts or sub-problems Range of Complex Engineering Activities Complex engineering activities as required in PO10 are engineering activities or projects that have some or all of EA1 to EA5 characteristics. Attribute Characteristics of Complex Engineering Activities EA1: Range of resources Involve the use of diverse resources (for this purpose, resources include people, money, equipment, materials, information and technologies) EA2: Level of interaction Require resolution of significant problems arising from interactions between wide-ranging or conflicting technical, engineering or other issues EA3: Innovation Involve creative use of engineering principles and research-based knowledge in novel ways EA4: Consequences for society and the environment Have significant consequences in a range of contexts, characterized by difficulty of prediction and mitigation EA5: Familiarity Can extend beyond previous experiences by applying principle-based approaches Course Summary Course Category Credits Compulsory Language and General Education Courses 9 Elective General Education Courses 9 Compulsory Basic Science Courses 11 Compulsory Mathematics and Statistics Courses 15 Core Computer Science and Engineering Courses 62 Core Capstone Project 6 Major Compulsory and Elective Computer Science and Engineering Courses 20 Non-major Elective Computer Science and Engineering Courses 8 Total 140 List of Courses Course Credits Prerequisite Compulsory Language and General Education Courses 9 ENG101 Basic English 3 ENG 102 Composition and Communication Skills 3 ENG101 GEN226 Emergence of Bangladesh 3 ENG102 Elective General Education Courses 9 Social Science Courses (any one course) 3 ECO101 Principle of Microeconomics 3 None GEN203 Ecological System and Environment 3 None GEN214 Development Studies 3 ENG102 SOC317 Sociology of Science and Technology 3 None Arts and Humanities Courses (any one course) 3 GEN201 Bangladesh Studies 3 ENG102 GEN204 Western Thought 3 None GEN210 International Relation 3 ENG102 SOC211 Eastern Culture and Heritage 3 None SOC217 Religion, Ethnicity, Culture and Development in South Asia 3 ENG102 Business Courses (any one course) 3 ACT101 Financial Accounting 3 None BUS321 Business for Engineering and Technology 3 ENG102 BUS231 Business Communication 3 ENG102 MGT321 Industrial Management 3 ENG102 MGT337 Production Operations Management 3 STA102 FIN101 Principle of Finance 3 STA102 MKT101 Principle of Marketing 3 None Compulsory Natural Science Courses 9+2=11 PHY109 Engineering Physics-I (Introductory Classical Physics) 3+1=4 MAT102 PHY209 Engineering Physics-II (Introductory Quantum Physics) 3+0=3 MAT205 CHE109 Engineering Chemistry 3+1=4 Compulsory Mathematics and Statistics Courses 15 MAT101 Differential and Integral Calculus 3 MAT102 Differential Equations and Special Functions 3 MAT101 MAT104 Coordinate Geometry and Vector Analysis 3 MAT101 MAT205 Linear Algebra and Complex Variable 3 MAT102 STA102 Statistics and Probability 3 Core Computer Science and Engineering Courses 48+14=62 CSE103 Structured Programming 3+1.5=4.5 CSE106 Discrete Mathematics 3+0=3 CSE103 CSE110 Object Oriented Programming 3+1.5=4.5 CSE106 CSE200 Computer-Aided Engineering Drawing 0+1=1 CSE209 Electrical Circuits 3+1=4 CSE207 Data Structures 3+1=4 CSE110 CSE251 Electronic Circuits 3+1=4 CSE209 CSE246 Algorithms 3+1.5=4.5 CSE207 CSE302 Database Systems 3+1.5=4.5 CSE106 CSE325 Operating Systems 3+1=4 CSE207 CSE345 Digital Logic Design 3+1=4 CSE251 CSE347 Information System Analysis and Design 3+1=4 CSE302 CSE360 Computer Architecture 3+0=3 CSE325 CSE405 Computer Networks 3+1=4 CSE246 CSE407 Green Computing 3+0=3 CSE405 CSE487 Cyber Security, Ethics and Law 3+0=3 CSE405 CSE495 IT Project Management and Entrepreneurship 3+0=3 CSE347 Core Capstone Project 0+6=6 CSE400 Capstone Project 0+6=6 Completed at least 105 credit hours Major Requirements Courses from the selected major area Student should select one of the four major areas for degree major requirement Two Compulsory courses (6+2=8 credits) Three elective courses (9+3=12 credits) Non-Major Elective Requirements Minimum 8 credits ( two to three courses depending on credits of the courses) from one or more major/non-major areas other than the selected major area Four Major Areas and Courses (2 Compulsory and 3 Elective Courses) 15+5=20 1. Intelligent Systems and Data Science 15+5=20 Compulsory Courses 6+2=8 CSE303 Statistics for Data Science 3+1=4 STA102 CSE366 Artificial Intelligence 3+1=4 CSE246 Elective Courses (Any 3 Courses) 9+3=12 CSE420 Computer Graphics 3+1=4 CSE246 CSE438 Digital Image Processing 3+1=4 CSE246 CSE445 Computer Vision 3+1=4 CSE246 CSE452 Distributed Systems and Algorithms 3+1=4 CSE325 CSE474 Pattern Recognition 3+1=4 CSE366 CSE475 Machine Learning 3+1=4 CSE366 CSE477 Data Mining 3+1=4 CSE366 CSE481 Nature-Inspired Computing 3+1=4 CSE246 CSE486 Bioinformatics Algorithms 3+1=4 CSE246 CSE488 Big Data Analytics 3+1=4 CSE302 2. Software Engineering 15+5=20 Compulsory Courses 6+2=8 CSE412 Software Engineering 3+1=4 CSE347 CSE430 Software Testing and Quality Assurance 3+1=4 CSE412 Elective Courses (Any 3 Courses) 9+3=12 CSE422 Simulation and Modeling 3+1=4 CSE246 CSE423 Software Architecture 3+1=4 CSE412 CSE428 Human Computer Interactions 3+1=4 CSE412 CSE452 Distributed Systems and Algorithms 3+1=4 CSE325 CSE464 Advanced Database System 3+1=4 CSE302 CSE479 Web Programming 3+1=4 CSE302 CSE489 Mobile Programming 3+1=4 CSE246 3. Communications and Networking 15+5=20 Compulsory Courses 6+2=8 CSE350 Data Communications 3+1=4 CSE251 CSE432 Digital Signal Processing 3+1=4 CSE246 Elective Courses (Any 3 Courses) 9+3=12 CSE452 Distributed Systems and Algorithms 3+1=4 CSE325 CSE453Wireless Networks 3+1=4 CSE405 CSE457 Cellular Networks 3+1=4 CSE405 CSE472 Advanced Network Services and Management 3+1=4 CSE405 CSE473 Network Security and Systems 3+1=4 CSE405 CSE489 Mobile Programming 3+1=4 CSE246 4. Hardware Engineering 15+5=20 Compulsory Courses 6+2=8 CSE355 Digital System Design 3+1=4 CSE345 CSE442 Microprocessors and Microcontrollers 3+1=4 CSE360 Elective Courses (Any 3 Courses) 9+3=12 CSE406 Internet of Things 3+1=4 CSE405 CSE446 ASIC Design Using FPGA 3+1=4 CSE345 CSE491 VLSI Design 3+1=4 CSE345 CSE492 Robotics 3+1=4 CSE366 CSE494 Embedded Systems 3+1=4 CSE442 Non-Major Area: Computational Theory CSE225 Numerical Methods 3+1=4 CSE103 CSE313 Theory of Computations 3+0=3 CSE246 CSE460 Cryptography 3+0=3 CSE246 CSE471 Compiler Design 3+1=4 CSE246 CSE483 Graph Theory 3+0=3 CSE246 CSE484 Computational Geometry 3+0=3 CSE246 Note: Course to PO mapping is under revision. Course Flowchart 1st Year 2nd Year 3rd Year 4th Year Course (Credit) Pre-requisite Course Pre-requisite Course Pre-requisite Course Pre-requisite 1st Semester ENG101 Basic English (3) GEN226 Emergence of Bangladesh (3) ENG102 Elective General Education-III (3) CSE400 Capstone Project-I (0+1=1) MAT101 Differential and Integral Calculus (3) STA102 Statistics and Probability (3) CSE246 Algorithms (3+1.5=4.5) CSE207 CSE407 Green Computing (3+0=3) CSE405 CSE103 Structured Programming (3+1.5=4.5) CSE200 Computer-Aided Engineering Drawing (0+1=1) CSE302 Database Systems (3+1.5=4.5) CSE106 Elective Major-I (3+1=4) CSE209 Electrical Circuits (3+1=4) Elective Non-Major-I (3+1=4) 2nd Semester ENG102 Composition And Communication Skills (3) ENG101 Elective General Education-I (3) CSE345 Digital Logic Design (3+1=4) CSE251 CSE400 Capstone Project-II (0+2=2) MAT102 Differential Equations and Special Functions (3) MAT101 MAT205 Linear Algebra and Complex Variables (3) MAT102 CSE347 Information System Analysis and Design (3+1=4) CSE302 CSE487 Cyber Security, Ethics and Law (3+0=3) CSE405 CSE106 Discrete Mathematics (3+0=3) CSE103 CSE207 Data Structures (3+1=4) CSE110 Compulsory Major-I (3+1=4) Elective Major-II (3+1=4) CHE109 Engineering Chemistry (3+1=4) CSE251 Electronic Circuits (3+1=4) CSE209 Elective Non-Major-II (3+1=4) 3rd Semester PHY109 Engineering Physics-I (3+1=4) MAT102 Elective General Education-II (3) CSE360 Computer Architecture (3+0=3) CSE325 CSE400 Capstone Project-III (0+3=3) MAT104 Coordinate Geometry and Vector Analysis (3) MAT101 PHY209 Engineering Physics-II (3+0=3) MAT205 CSE 405 Computer Networks (3+1=4) CSE246 CSE495 IT Project Management and Entrepreneurship (3+0=3) CSE347 CSE110 Object Oriented Programming (3+1.5=4.5) CSE106 CSE325 Operating Systems (3+1=4) CSE207 Compulsory Major-II (3+1=4) Elective Major-III (3+1=4) Year-Credit 35 35 35 35 Department of Computer Science & Engineering Faculty Member Undergraduate Programs Graduate Programs Tuition Fees Publications Research Area Lab Facilities Administrative Officials News Notices Events Achievements Contact Us Your Bright Future is Our Mission Click to Apply Online Apply Now Department Office A/2, Jahurul Islam Avenue Jahurul Islam City, Aftabnagar Dhaka-1212, Bangladesh 09666775577",
      "characteristics": "Ext. – 206 cse@ewubd.edu Student Academic Calendar Campus Life Payment Procedure Convocation Rules & Regulation Faculty Search Grading Policy University Directory Proctor Schedule E-Tender Procurement Gallery Journal and Publications Archives Quick Links Apply Online Jobs at EWU Degree Verification Contact Us Location Map Developed and maintained by ICS, EWU Copyright@ 2025 East West University 191,311,198 Total view, 23,927,878 Views Today Top"
    }
  },
  "complex_problem_solving_description": "Complex engineering problem solving as required in PO1, PO2, PO3, PO4, PO5, PO6, and PO7 are problems that have EP1 and some or all of EP2 to EP7 characteristics. Attribute Characteristics of Complex Engineering Problems EP1: Depth of knowledge required Cannot be resolved without in-depth engineering knowledge at the level of one or more of K3, K4, K5, K6, or K8 which allows a fundamental-based, first principles analytical approach EP2: Range of conflicting requirements Involve wide-ranging or conflicting technical, engineering and other issues EP3: Depth of analysis required Have no obvious solution and require abstract thinking, originality in analysis to formulate suitable models EP4: Familiarity of issues Involve infrequently encountered issues EP5: Extent of applicable codes Are outside problems encompassed by standards and codes of practice for professional engineering EP 6: Extent of stakeholder involvement and conflicting requirements Involve diverse groups of stakeholders with widely varying needs EP7: Interdependence Are high level problems including many component parts or sub-problems Range of Complex Engineering Activities Complex engineering activities as required in PO10 are engineering activities or projects that have some or all of EA1 to EA5 characteristics. Attribute Characteristics of Complex Engineering Activities EA1: Range of resources Involve the use of diverse resources (for this purpose, resources include people, money, equipment, materials, information and technologies) EA2: Level of interaction Require resolution of significant problems arising from interactions between wide-ranging or conflicting technical, engineering or other issues EA3: Innovation Involve creative use of engineering principles and research-based knowledge in novel ways EA4: Consequences for society and the environment Have significant consequences in a range of contexts, characterized by difficulty of prediction and mitigation EA5: Familiarity Can extend beyond previous experiences by applying principle-based approaches Course Summary Course Category Credits Compulsory Language and General Education Courses 9 Elective General Education Courses 9 Compulsory Basic Science Courses 11 Compulsory Mathematics and Statistics Courses 15 Core Computer Science and Engineering Courses 62 Core Capstone Project 6 Major Compulsory and Elective Computer Science and Engineering Courses 20 Non-major Elective Computer Science and Engineering Courses 8 Total 140 List of Courses Course Credits Prerequisite Compulsory Language and General Education Courses 9 ENG101 Basic English 3 ENG 102 Composition and Communication Skills 3 ENG101 GEN226 Emergence of Bangladesh 3 ENG102 Elective General Education Courses 9 Social Science Courses (any one course) 3 ECO101 Principle of Microeconomics 3 None GEN203 Ecological System and Environment 3 None GEN214 Development Studies 3 ENG102 SOC317 Sociology of Science and Technology 3 None Arts and Humanities Courses (any one course) 3 GEN201 Bangladesh Studies 3 ENG102 GEN204 Western Thought 3 None GEN210 International Relation 3 ENG102 SOC211 Eastern Culture and Heritage 3 None SOC217 Religion, Ethnicity, Culture and Development in South Asia 3 ENG102 Business Courses (any one course) 3 ACT101 Financial Accounting 3 None BUS321 Business for Engineering and Technology 3 ENG102 BUS231 Business Communication 3 ENG102 MGT321 Industrial Management 3 ENG102 MGT337 Production Operations Management 3 STA102 FIN101 Principle of Finance 3 STA102 MKT101 Principle of Marketing 3 None Compulsory Natural Science Courses 9+2=11 PHY109 Engineering Physics-I (Introductory Classical Physics) 3+1=4 MAT102 PHY209 Engineering Physics-II (Introductory Quantum Physics) 3+0=3 MAT205 CHE109 Engineering Chemistry 3+1=4 Compulsory Mathematics and Statistics Courses 15 MAT101 Differential and Integral Calculus 3 MAT102 Differential Equations and Special Functions 3 MAT101 MAT104 Coordinate Geometry and Vector Analysis 3 MAT101 MAT205 Linear Algebra and Complex Variable 3 MAT102 STA102 Statistics and Probability 3 Core Computer Science and Engineering Courses 48+14=62 CSE103 Structured Programming 3+1.5=4.5 CSE106 Discrete Mathematics 3+0=3 CSE103 CSE110 Object Oriented Programming 3+1.5=4.5 CSE106 CSE200 Computer-Aided Engineering Drawing 0+1=1 CSE209 Electrical Circuits 3+1=4 CSE207 Data Structures 3+1=4 CSE110 CSE251 Electronic Circuits 3+1=4 CSE209 CSE246 Algorithms 3+1.5=4.5 CSE207 CSE302 Database Systems 3+1.5=4.5 CSE106 CSE325 Operating Systems 3+1=4 CSE207 CSE345 Digital Logic Design 3+1=4 CSE251 CSE347 Information System Analysis and Design 3+1=4 CSE302 CSE360 Computer Architecture 3+0=3 CSE325 CSE405 Computer Networks 3+1=4 CSE246 CSE407 Green Computing 3+0=3 CSE405 CSE487 Cyber Security, Ethics and Law 3+0=3 CSE405 CSE495 IT Project Management and Entrepreneurship 3+0=3 CSE347 Core Capstone Project 0+6=6 CSE400 Capstone Project 0+6=6 Completed at least 105 credit hours Major Requirements Courses from the selected major area Student should select one of the four major areas for degree major requirement Two Compulsory courses (6+2=8 credits) Three elective courses (9+3=12 credits) Non-Major Elective Requirements Minimum 8 credits ( two to three courses depending on credits of the courses) from one or more major/non-major areas other than the selected major area Four Major Areas and Courses (2 Compulsory and 3 Elective Courses) 15+5=20 1. Intelligent Systems and Data Science 15+5=20 Compulsory Courses 6+2=8 CSE303 Statistics for Data Science 3+1=4 STA102 CSE366 Artificial Intelligence 3+1=4 CSE246 Elective Courses (Any 3 Courses) 9+3=12 CSE420 Computer Graphics 3+1=4 CSE246 CSE438 Digital Image Processing 3+1=4 CSE246 CSE445 Computer Vision 3+1=4 CSE246 CSE452 Distributed Systems and Algorithms 3+1=4 CSE325 CSE474 Pattern Recognition 3+1=4 CSE366 CSE475 Machine Learning 3+1=4 CSE366 CSE477 Data Mining 3+1=4 CSE366 CSE481 Nature-Inspired Computing 3+1=4 CSE246 CSE486 Bioinformatics Algorithms 3+1=4 CSE246 CSE488 Big Data Analytics 3+1=4 CSE302 2. Software Engineering 15+5=20 Compulsory Courses 6+2=8 CSE412 Software Engineering 3+1=4 CSE347 CSE430 Software Testing and Quality Assurance 3+1=4 CSE412 Elective Courses (Any 3 Courses) 9+3=12 CSE422 Simulation and Modeling 3+1=4 CSE246 CSE423 Software Architecture 3+1=4 CSE412 CSE428 Human Computer Interactions 3+1=4 CSE412 CSE452 Distributed Systems and Algorithms 3+1=4 CSE325 CSE464 Advanced Database System 3+1=4 CSE302 CSE479 Web Programming 3+1=4 CSE302 CSE489 Mobile Programming 3+1=4 CSE246 3. Communications and Networking 15+5=20 Compulsory Courses 6+2=8 CSE350 Data Communications 3+1=4 CSE251 CSE432 Digital Signal Processing 3+1=4 CSE246 Elective Courses (Any 3 Courses) 9+3=12 CSE452 Distributed Systems and Algorithms 3+1=4 CSE325 CSE453Wireless Networks 3+1=4 CSE405 CSE457 Cellular Networks 3+1=4 CSE405 CSE472 Advanced Network Services and Management 3+1=4 CSE405 CSE473 Network Security and Systems 3+1=4 CSE405 CSE489 Mobile Programming 3+1=4 CSE246 4. Hardware Engineering 15+5=20 Compulsory Courses 6+2=8 CSE355 Digital System Design 3+1=4 CSE345 CSE442 Microprocessors and Microcontrollers 3+1=4 CSE360 Elective Courses (Any 3 Courses) 9+3=12 CSE406 Internet of Things 3+1=4 CSE405 CSE446 ASIC Design Using FPGA 3+1=4 CSE345 CSE491 VLSI Design 3+1=4 CSE345 CSE492 Robotics 3+1=4 CSE366 CSE494 Embedded Systems 3+1=4 CSE442 Non-Major Area: Computational Theory CSE225 Numerical Methods 3+1=4 CSE103 CSE313 Theory of Computations 3+0=3 CSE246 CSE460 Cryptography 3+0=3 CSE246 CSE471 Compiler Design 3+1=4 CSE246 CSE483 Graph Theory 3+0=3 CSE246 CSE484 Computational Geometry 3+0=3 CSE246 Note: Course to PO mapping is under revision. Course Flowchart 1st Year 2nd Year 3rd Year 4th Year Course (Credit) Pre-requisite Course Pre-requisite Course Pre-requisite Course Pre-requisite 1st Semester ENG101 Basic English (3) GEN226 Emergence of Bangladesh (3) ENG102 Elective General Education-III (3) CSE400 Capstone Project-I (0+1=1) MAT101 Differential and Integral Calculus (3) STA102 Statistics and Probability (3) CSE246 Algorithms (3+1.5=4.5) CSE207 CSE407 Green Computing (3+0=3) CSE405 CSE103 Structured Programming (3+1.5=4.5) CSE200 Computer-Aided Engineering Drawing (0+1=1) CSE302 Database Systems (3+1.5=4.5) CSE106 Elective Major-I (3+1=4) CSE209 Electrical Circuits (3+1=4) Elective Non-Major-I (3+1=4) 2nd Semester ENG102 Composition And Communication Skills (3) ENG101 Elective General Education-I (3) CSE345 Digital Logic Design (3+1=4) CSE251 CSE400 Capstone Project-II (0+2=2) MAT102 Differential Equations and Special Functions (3) MAT101 MAT205 Linear Algebra and Complex Variables (3) MAT102 CSE347 Information System Analysis and Design (3+1=4) CSE302 CSE487 Cyber Security, Ethics and Law (3+0=3) CSE405 CSE106 Discrete Mathematics (3+0=3) CSE103 CSE207 Data Structures (3+1=4) CSE110 Compulsory Major-I (3+1=4) Elective Major-II (3+1=4) CHE109 Engineering Chemistry (3+1=4) CSE251 Electronic Circuits (3+1=4) CSE209 Elective Non-Major-II (3+1=4) 3rd Semester PHY109 Engineering Physics-I (3+1=4) MAT102 Elective General Education-II (3) CSE360 Computer Architecture (3+0=3) CSE325 CSE400 Capstone Project-III (0+3=3) MAT104 Coordinate Geometry and Vector Analysis (3) MAT101 PHY209 Engineering Physics-II (3+0=3) MAT205 CSE 405 Computer Networks (3+1=4) CSE246 CSE495 IT Project Management and Entrepreneurship (3+0=3) CSE347 CSE110 Object Oriented Programming (3+1.5=4.5) CSE106 CSE325 Operating Systems (3+1=4) CSE207 Compulsory Major-II (3+1=4) Elective Major-III (3+1=4) Year-Credit 35 35 35 35 Department of Computer Science & Engineering Faculty Member Undergraduate Programs Graduate Programs Tuition Fees Publications Research Area Lab Facilities Administrative Officials News Notices Events Achievements Contact Us Your Bright Future is Our Mission Click to Apply Online Apply Now Department Office A/2, Jahurul Islam Avenue Jahurul Islam City, Aftabnagar Dhaka-1212, Bangladesh 09666775577 | Ext. – 206 cse@ewubd.edu Student Academic Calendar Campus Life Payment Procedure Convocation Rules & Regulation Faculty Search Grading Policy University Directory Proctor Schedule E-Tender Procurement Gallery Journal and Publications Archives Quick Links Apply Online Jobs at EWU Degree Verification Contact Us Location Map Developed and maintained by ICS, EWU Copyright@ 2025 East West University 191,311,198 Total view, 23,927,878 Views Today Top",
  "complex_activities": {
    "EA1": {
      "attribute": "Range of resources Involve the use of diverse resources (for this purpose, resources include people, money, equipment, materials, information and technologies) EA2: Level of interaction Require resolution of significant problems arising from interactions between wide-ranging or conflicting technical, engineering or other issues EA3: Innovation Involve creative use of engineering principles and research-based knowledge in novel ways EA4: Consequences for society and the environment Have significant consequences in a range of contexts, characterized by difficulty of prediction and mitigation EA5: Familiarity Can extend beyond previous experiences by applying principle-based approaches Course Summary Course Category Credits Compulsory Language and General Education Courses 9 Elective General Education Courses 9 Compulsory Basic Science Courses 11 Compulsory Mathematics and Statistics Courses 15 Core Computer Science and Engineering Courses 62 Core Capstone Project 6 Major Compulsory and Elective Computer Science and Engineering Courses 20 Non-major Elective Computer Science and Engineering Courses 8 Total 140 List of Courses Course Credits Prerequisite Compulsory Language and General Education Courses 9 ENG101 Basic English 3 ENG 102 Composition and Communication Skills 3 ENG101 GEN226 Emergence of Bangladesh 3 ENG102 Elective General Education Courses 9 Social Science Courses (any one course) 3 ECO101 Principle of Microeconomics 3 None GEN203 Ecological System and Environment 3 None GEN214 Development Studies 3 ENG102 SOC317 Sociology of Science and Technology 3 None Arts and Humanities Courses (any one course) 3 GEN201 Bangladesh Studies 3 ENG102 GEN204 Western Thought 3 None GEN210 International Relation 3 ENG102 SOC211 Eastern Culture and Heritage 3 None SOC217 Religion, Ethnicity, Culture and Development in South Asia 3 ENG102 Business Courses (any one course) 3 ACT101 Financial Accounting 3 None BUS321 Business for Engineering and Technology 3 ENG102 BUS231 Business Communication 3 ENG102 MGT321 Industrial Management 3 ENG102 MGT337 Production Operations Management 3 STA102 FIN101 Principle of Finance 3 STA102 MKT101 Principle of Marketing 3 None Compulsory Natural Science Courses 9+2=11 PHY109 Engineering Physics-I (Introductory Classical Physics) 3+1=4 MAT102 PHY209 Engineering Physics-II (Introductory Quantum Physics) 3+0=3 MAT205 CHE109 Engineering Chemistry 3+1=4 Compulsory Mathematics and Statistics Courses 15 MAT101 Differential and Integral Calculus 3 MAT102 Differential Equations and Special Functions 3 MAT101 MAT104 Coordinate Geometry and Vector Analysis 3 MAT101 MAT205 Linear Algebra and Complex Variable 3 MAT102 STA102 Statistics and Probability 3 Core Computer Science and Engineering Courses 48+14=62 CSE103 Structured Programming 3+1.5=4.5 CSE106 Discrete Mathematics 3+0=3 CSE103 CSE110 Object Oriented Programming 3+1.5=4.5 CSE106 CSE200 Computer-Aided Engineering Drawing 0+1=1 CSE209 Electrical Circuits 3+1=4 CSE207 Data Structures 3+1=4 CSE110 CSE251 Electronic Circuits 3+1=4 CSE209 CSE246 Algorithms 3+1.5=4.5 CSE207 CSE302 Database Systems 3+1.5=4.5 CSE106 CSE325 Operating Systems 3+1=4 CSE207 CSE345 Digital Logic Design 3+1=4 CSE251 CSE347 Information System Analysis and Design 3+1=4 CSE302 CSE360 Computer Architecture 3+0=3 CSE325 CSE405 Computer Networks 3+1=4 CSE246 CSE407 Green Computing 3+0=3 CSE405 CSE487 Cyber Security, Ethics and Law 3+0=3 CSE405 CSE495 IT Project Management and Entrepreneurship 3+0=3 CSE347 Core Capstone Project 0+6=6 CSE400 Capstone Project 0+6=6 Completed at least 105 credit hours Major Requirements Courses from the selected major area Student should select one of the four major areas for degree major requirement Two Compulsory courses (6+2=8 credits) Three elective courses (9+3=12 credits) Non-Major Elective Requirements Minimum 8 credits ( two to three courses depending on credits of the courses) from one or more major/non-major areas other than the selected major area Four Major Areas and Courses (2 Compulsory and 3 Elective Courses) 15+5=20 1. Intelligent Systems and Data Science 15+5=20 Compulsory Courses 6+2=8 CSE303 Statistics for Data Science 3+1=4 STA102 CSE366 Artificial Intelligence 3+1=4 CSE246 Elective Courses (Any 3 Courses) 9+3=12 CSE420 Computer Graphics 3+1=4 CSE246 CSE438 Digital Image Processing 3+1=4 CSE246 CSE445 Computer Vision 3+1=4 CSE246 CSE452 Distributed Systems and Algorithms 3+1=4 CSE325 CSE474 Pattern Recognition 3+1=4 CSE366 CSE475 Machine Learning 3+1=4 CSE366 CSE477 Data Mining 3+1=4 CSE366 CSE481 Nature-Inspired Computing 3+1=4 CSE246 CSE486 Bioinformatics Algorithms 3+1=4 CSE246 CSE488 Big Data Analytics 3+1=4 CSE302 2. Software Engineering 15+5=20 Compulsory Courses 6+2=8 CSE412 Software Engineering 3+1=4 CSE347 CSE430 Software Testing and Quality Assurance 3+1=4 CSE412 Elective Courses (Any 3 Courses) 9+3=12 CSE422 Simulation and Modeling 3+1=4 CSE246 CSE423 Software Architecture 3+1=4 CSE412 CSE428 Human Computer Interactions 3+1=4 CSE412 CSE452 Distributed Systems and Algorithms 3+1=4 CSE325 CSE464 Advanced Database System 3+1=4 CSE302 CSE479 Web Programming 3+1=4 CSE302 CSE489 Mobile Programming 3+1=4 CSE246 3. Communications and Networking 15+5=20 Compulsory Courses 6+2=8 CSE350 Data Communications 3+1=4 CSE251 CSE432 Digital Signal Processing 3+1=4 CSE246 Elective Courses (Any 3 Courses) 9+3=12 CSE452 Distributed Systems and Algorithms 3+1=4 CSE325 CSE453Wireless Networks 3+1=4 CSE405 CSE457 Cellular Networks 3+1=4 CSE405 CSE472 Advanced Network Services and Management 3+1=4 CSE405 CSE473 Network Security and Systems 3+1=4 CSE405 CSE489 Mobile Programming 3+1=4 CSE246 4. Hardware Engineering 15+5=20 Compulsory Courses 6+2=8 CSE355 Digital System Design 3+1=4 CSE345 CSE442 Microprocessors and Microcontrollers 3+1=4 CSE360 Elective Courses (Any 3 Courses) 9+3=12 CSE406 Internet of Things 3+1=4 CSE405 CSE446 ASIC Design Using FPGA 3+1=4 CSE345 CSE491 VLSI Design 3+1=4 CSE345 CSE492 Robotics 3+1=4 CSE366 CSE494 Embedded Systems 3+1=4 CSE442 Non-Major Area: Computational Theory CSE225 Numerical Methods 3+1=4 CSE103 CSE313 Theory of Computations 3+0=3 CSE246 CSE460 Cryptography 3+0=3 CSE246 CSE471 Compiler Design 3+1=4 CSE246 CSE483 Graph Theory 3+0=3 CSE246 CSE484 Computational Geometry 3+0=3 CSE246 Note: Course to PO mapping is under revision. Course Flowchart 1st Year 2nd Year 3rd Year 4th Year Course (Credit) Pre-requisite Course Pre-requisite Course Pre-requisite Course Pre-requisite 1st Semester ENG101 Basic English (3) GEN226 Emergence of Bangladesh (3) ENG102 Elective General Education-III (3) CSE400 Capstone Project-I (0+1=1) MAT101 Differential and Integral Calculus (3) STA102 Statistics and Probability (3) CSE246 Algorithms (3+1.5=4.5) CSE207 CSE407 Green Computing (3+0=3) CSE405 CSE103 Structured Programming (3+1.5=4.5) CSE200 Computer-Aided Engineering Drawing (0+1=1) CSE302 Database Systems (3+1.5=4.5) CSE106 Elective Major-I (3+1=4) CSE209 Electrical Circuits (3+1=4) Elective Non-Major-I (3+1=4) 2nd Semester ENG102 Composition And Communication Skills (3) ENG101 Elective General Education-I (3) CSE345 Digital Logic Design (3+1=4) CSE251 CSE400 Capstone Project-II (0+2=2) MAT102 Differential Equations and Special Functions (3) MAT101 MAT205 Linear Algebra and Complex Variables (3) MAT102 CSE347 Information System Analysis and Design (3+1=4) CSE302 CSE487 Cyber Security, Ethics and Law (3+0=3) CSE405 CSE106 Discrete Mathematics (3+0=3) CSE103 CSE207 Data Structures (3+1=4) CSE110 Compulsory Major-I (3+1=4) Elective Major-II (3+1=4) CHE109 Engineering Chemistry (3+1=4) CSE251 Electronic Circuits (3+1=4) CSE209 Elective Non-Major-II (3+1=4) 3rd Semester PHY109 Engineering Physics-I (3+1=4) MAT102 Elective General Education-II (3) CSE360 Computer Architecture (3+0=3) CSE325 CSE400 Capstone Project-III (0+3=3) MAT104 Coordinate Geometry and Vector Analysis (3) MAT101 PHY209 Engineering Physics-II (3+0=3) MAT205 CSE 405 Computer Networks (3+1=4) CSE246 CSE495 IT Project Management and Entrepreneurship (3+0=3) CSE347 CSE110 Object Oriented Programming (3+1.5=4.5) CSE106 CSE325 Operating Systems (3+1=4) CSE207 Compulsory Major-II (3+1=4) Elective Major-III (3+1=4) Year-Credit 35 35 35 35 Department of Computer Science & Engineering Faculty Member Undergraduate Programs Graduate Programs Tuition Fees Publications Research Area Lab Facilities Administrative Officials News Notices Events Achievements Contact Us Your Bright Future is Our Mission Click to Apply Online Apply Now Department Office A/2, Jahurul Islam Avenue Jahurul Islam City, Aftabnagar Dhaka-1212, Bangladesh 09666775577",
      "characteristics": "Ext. – 206 cse@ewubd.edu Student Academic Calendar Campus Life Payment Procedure Convocation Rules & Regulation Faculty Search Grading Policy University Directory Proctor Schedule E-Tender Procurement Gallery Journal and Publications Archives Quick Links Apply Online Jobs at EWU Degree Verification Contact Us Location Map Developed and maintained by ICS, EWU Copyright@ 2025 East West University 191,311,198 Total view, 23,927,878 Views Today Top"
    }
  },
  "complex_activities_description": "Complex engineering activities as required in PO10 are engineering activities or projects that have some or all of EA1 to EA5 characteristics. Attribute Characteristics of Complex Engineering Activities EA1: Range of resources Involve the use of diverse resources (for this purpose, resources include people, money, equipment, materials, information and technologies) EA2: Level of interaction Require resolution of significant problems arising from interactions between wide-ranging or conflicting technical, engineering or other issues EA3: Innovation Involve creative use of engineering principles and research-based knowledge in novel ways EA4: Consequences for society and the environment Have significant consequences in a range of contexts, characterized by difficulty of prediction and mitigation EA5: Familiarity Can extend beyond previous experiences by applying principle-based approaches Course Summary Course Category Credits Compulsory Language and General Education Courses 9 Elective General Education Courses 9 Compulsory Basic Science Courses 11 Compulsory Mathematics and Statistics Courses 15 Core Computer Science and Engineering Courses 62 Core Capstone Project 6 Major Compulsory and Elective Computer Science and Engineering Courses 20 Non-major Elective Computer Science and Engineering Courses 8 Total 140 List of Courses Course Credits Prerequisite Compulsory Language and General Education Courses 9 ENG101 Basic English 3 ENG 102 Composition and Communication Skills 3 ENG101 GEN226 Emergence of Bangladesh 3 ENG102 Elective General Education Courses 9 Social Science Courses (any one course) 3 ECO101 Principle of Microeconomics 3 None GEN203 Ecological System and Environment 3 None GEN214 Development Studies 3 ENG102 SOC317 Sociology of Science and Technology 3 None Arts and Humanities Courses (any one course) 3 GEN201 Bangladesh Studies 3 ENG102 GEN204 Western Thought 3 None GEN210 International Relation 3 ENG102 SOC211 Eastern Culture and Heritage 3 None SOC217 Religion, Ethnicity, Culture and Development in South Asia 3 ENG102 Business Courses (any one course) 3 ACT101 Financial Accounting 3 None BUS321 Business for Engineering and Technology 3 ENG102 BUS231 Business Communication 3 ENG102 MGT321 Industrial Management 3 ENG102 MGT337 Production Operations Management 3 STA102 FIN101 Principle of Finance 3 STA102 MKT101 Principle of Marketing 3 None Compulsory Natural Science Courses 9+2=11 PHY109 Engineering Physics-I (Introductory Classical Physics) 3+1=4 MAT102 PHY209 Engineering Physics-II (Introductory Quantum Physics) 3+0=3 MAT205 CHE109 Engineering Chemistry 3+1=4 Compulsory Mathematics and Statistics Courses 15 MAT101 Differential and Integral Calculus 3 MAT102 Differential Equations and Special Functions 3 MAT101 MAT104 Coordinate Geometry and Vector Analysis 3 MAT101 MAT205 Linear Algebra and Complex Variable 3 MAT102 STA102 Statistics and Probability 3 Core Computer Science and Engineering Courses 48+14=62 CSE103 Structured Programming 3+1.5=4.5 CSE106 Discrete Mathematics 3+0=3 CSE103 CSE110 Object Oriented Programming 3+1.5=4.5 CSE106 CSE200 Computer-Aided Engineering Drawing 0+1=1 CSE209 Electrical Circuits 3+1=4 CSE207 Data Structures 3+1=4 CSE110 CSE251 Electronic Circuits 3+1=4 CSE209 CSE246 Algorithms 3+1.5=4.5 CSE207 CSE302 Database Systems 3+1.5=4.5 CSE106 CSE325 Operating Systems 3+1=4 CSE207 CSE345 Digital Logic Design 3+1=4 CSE251 CSE347 Information System Analysis and Design 3+1=4 CSE302 CSE360 Computer Architecture 3+0=3 CSE325 CSE405 Computer Networks 3+1=4 CSE246 CSE407 Green Computing 3+0=3 CSE405 CSE487 Cyber Security, Ethics and Law 3+0=3 CSE405 CSE495 IT Project Management and Entrepreneurship 3+0=3 CSE347 Core Capstone Project 0+6=6 CSE400 Capstone Project 0+6=6 Completed at least 105 credit hours Major Requirements Courses from the selected major area Student should select one of the four major areas for degree major requirement Two Compulsory courses (6+2=8 credits) Three elective courses (9+3=12 credits) Non-Major Elective Requirements Minimum 8 credits ( two to three courses depending on credits of the courses) from one or more major/non-major areas other than the selected major area Four Major Areas and Courses (2 Compulsory and 3 Elective Courses) 15+5=20 1. Intelligent Systems and Data Science 15+5=20 Compulsory Courses 6+2=8 CSE303 Statistics for Data Science 3+1=4 STA102 CSE366 Artificial Intelligence 3+1=4 CSE246 Elective Courses (Any 3 Courses) 9+3=12 CSE420 Computer Graphics 3+1=4 CSE246 CSE438 Digital Image Processing 3+1=4 CSE246 CSE445 Computer Vision 3+1=4 CSE246 CSE452 Distributed Systems and Algorithms 3+1=4 CSE325 CSE474 Pattern Recognition 3+1=4 CSE366 CSE475 Machine Learning 3+1=4 CSE366 CSE477 Data Mining 3+1=4 CSE366 CSE481 Nature-Inspired Computing 3+1=4 CSE246 CSE486 Bioinformatics Algorithms 3+1=4 CSE246 CSE488 Big Data Analytics 3+1=4 CSE302 2. Software Engineering 15+5=20 Compulsory Courses 6+2=8 CSE412 Software Engineering 3+1=4 CSE347 CSE430 Software Testing and Quality Assurance 3+1=4 CSE412 Elective Courses (Any 3 Courses) 9+3=12 CSE422 Simulation and Modeling 3+1=4 CSE246 CSE423 Software Architecture 3+1=4 CSE412 CSE428 Human Computer Interactions 3+1=4 CSE412 CSE452 Distributed Systems and Algorithms 3+1=4 CSE325 CSE464 Advanced Database System 3+1=4 CSE302 CSE479 Web Programming 3+1=4 CSE302 CSE489 Mobile Programming 3+1=4 CSE246 3. Communications and Networking 15+5=20 Compulsory Courses 6+2=8 CSE350 Data Communications 3+1=4 CSE251 CSE432 Digital Signal Processing 3+1=4 CSE246 Elective Courses (Any 3 Courses) 9+3=12 CSE452 Distributed Systems and Algorithms 3+1=4 CSE325 CSE453Wireless Networks 3+1=4 CSE405 CSE457 Cellular Networks 3+1=4 CSE405 CSE472 Advanced Network Services and Management 3+1=4 CSE405 CSE473 Network Security and Systems 3+1=4 CSE405 CSE489 Mobile Programming 3+1=4 CSE246 4. Hardware Engineering 15+5=20 Compulsory Courses 6+2=8 CSE355 Digital System Design 3+1=4 CSE345 CSE442 Microprocessors and Microcontrollers 3+1=4 CSE360 Elective Courses (Any 3 Courses) 9+3=12 CSE406 Internet of Things 3+1=4 CSE405 CSE446 ASIC Design Using FPGA 3+1=4 CSE345 CSE491 VLSI Design 3+1=4 CSE345 CSE492 Robotics 3+1=4 CSE366 CSE494 Embedded Systems 3+1=4 CSE442 Non-Major Area: Computational Theory CSE225 Numerical Methods 3+1=4 CSE103 CSE313 Theory of Computations 3+0=3 CSE246 CSE460 Cryptography 3+0=3 CSE246 CSE471 Compiler Design 3+1=4 CSE246 CSE483 Graph Theory 3+0=3 CSE246 CSE484 Computational Geometry 3+0=3 CSE246 Note: Course to PO mapping is under revision. Course Flowchart 1st Year 2nd Year 3rd Year 4th Year Course (Credit) Pre-requisite Course Pre-requisite Course Pre-requisite Course Pre-requisite 1st Semester ENG101 Basic English (3) GEN226 Emergence of Bangladesh (3) ENG102 Elective General Education-III (3) CSE400 Capstone Project-I (0+1=1) MAT101 Differential and Integral Calculus (3) STA102 Statistics and Probability (3) CSE246 Algorithms (3+1.5=4.5) CSE207 CSE407 Green Computing (3+0=3) CSE405 CSE103 Structured Programming (3+1.5=4.5) CSE200 Computer-Aided Engineering Drawing (0+1=1) CSE302 Database Systems (3+1.5=4.5) CSE106 Elective Major-I (3+1=4) CSE209 Electrical Circuits (3+1=4) Elective Non-Major-I (3+1=4) 2nd Semester ENG102 Composition And Communication Skills (3) ENG101 Elective General Education-I (3) CSE345 Digital Logic Design (3+1=4) CSE251 CSE400 Capstone Project-II (0+2=2) MAT102 Differential Equations and Special Functions (3) MAT101 MAT205 Linear Algebra and Complex Variables (3) MAT102 CSE347 Information System Analysis and Design (3+1=4) CSE302 CSE487 Cyber Security, Ethics and Law (3+0=3) CSE405 CSE106 Discrete Mathematics (3+0=3) CSE103 CSE207 Data Structures (3+1=4) CSE110 Compulsory Major-I (3+1=4) Elective Major-II (3+1=4) CHE109 Engineering Chemistry (3+1=4) CSE251 Electronic Circuits (3+1=4) CSE209 Elective Non-Major-II (3+1=4) 3rd Semester PHY109 Engineering Physics-I (3+1=4) MAT102 Elective General Education-II (3) CSE360 Computer Architecture (3+0=3) CSE325 CSE400 Capstone Project-III (0+3=3) MAT104 Coordinate Geometry and Vector Analysis (3) MAT101 PHY209 Engineering Physics-II (3+0=3) MAT205 CSE 405 Computer Networks (3+1=4) CSE246 CSE495 IT Project Management and Entrepreneurship (3+0=3) CSE347 CSE110 Object Oriented Programming (3+1.5=4.5) CSE106 CSE325 Operating Systems (3+1=4) CSE207 Compulsory Major-II (3+1=4) Elective Major-III (3+1=4) Year-Credit 35 35 35 35 Department of Computer Science & Engineering Faculty Member Undergraduate Programs Graduate Programs Tuition Fees Publications Research Area Lab Facilities Administrative Officials News Notices Events Achievements Contact Us Your Bright Future is Our Mission Click to Apply Online Apply Now Department Office A/2, Jahurul Islam Avenue Jahurul Islam City, Aftabnagar Dhaka-1212, Bangladesh 09666775577 | Ext. – 206 cse@ewubd.edu Student Academic Calendar Campus Life Payment Procedure Convocation Rules & Regulation Faculty Search Grading Policy University Directory Proctor Schedule E-Tender Procurement Gallery Journal and Publications Archives Quick Links Apply Online Jobs at EWU Degree Verification Contact Us Location Map Developed and maintained by ICS, EWU Copyright@ 2025 East West University 191,311,198 Total view, 23,927,878 Views Today Top",
  "course_summary": {},
  "course_summary_total": 0,
  "course_lists": {
    "compulsory_language_general_education": {
      "total_credits": 9,
      "courses": []
    },
    "elective_general_education": {
      "total_credits": 9,
      "categories": {
        "social_science": [],
        "arts_humanities": [],
        "business": []
      }
    },
    "compulsory_natural_science": {
      "total_credits": "9+2=11",
      "courses": []
    },
    "compulsory_mathematics_statistics": {
      "total_credits": 15,
      "courses": []
    },
    "core_cse": {
      "total_credits": "48+14=62",
      "courses": []
    },
    "core_capstone": {
      "total_credits": "0+6=6",
      "courses": []
    },
    "major_areas": [
      {
        "number": "1",
        "name": "Intelligent Systems and Data Science",
        "total_credits": "15+5=20",
        "compulsory_courses": {
          "credits": "6+2=8",
          "courses": []
        },
        "elective_courses": {
          "credits": "9+3=12",
          "note": "Any 3 Courses",
          "courses": []
        }
      },
      {
        "number": "2",
        "name": "Software Engineering",
        "total_credits": "15+5=20",
        "compulsory_courses": {
          "credits": "6+2=8",
          "courses": []
        },
        "elective_courses": {
          "credits": "9+3=12",
          "note": "Any 3 Courses",
          "courses": []
        }
      },
      {
        "number": "3",
        "name": "Communications and Networking",
        "total_credits": "15+5=20",
        "compulsory_courses": {
          "credits": "6+2=8",
          "courses": []
        },
        "elective_courses": {
          "credits": "9+3=12",
          "note": "Any 3 Courses",
          "courses": []
        }
      },
      {
        "number": "4",
        "name": "Hardware Engineering",
        "total_credits": "15+5=20",
        "compulsory_courses": {
          "credits": "6+2=8",
          "courses": []
        },
        "elective_courses": {
          "credits": "9+3=12",
          "note": "Any 3 Courses",
          "courses": []
        }
      }
    ],
    "non_major_area": {
      "name": "Computational Theory",
      "courses": []
    }
  },
  "major_requirements": {
    "description": "Student should select one of the four major areas for degree major requirement",
    "compulsory_courses": "Two Compulsory courses (6+2=8 credits)",
    "elective_courses": "Three elective courses (9+3=12 credits)"
  },
  "non_major_requirements": "Minimum 8 credits ( two to three courses depending on credits of the courses) from one or more major/non-major areas other than the selected major area",
  "course_flowchart": {
    "first_year": {
      "semester_1": [
        {
          "code": "ENG101",
          "credits": "3"
        },
        {
          "code": "GEN226",
          "credits": "3"
        },
        {
          "code": "ENG102",
          "credits": "3"
        },
        {
          "code": "CSE400",
          "credits": "0+1=1"
        },
        {
          "code": "MAT101",
          "credits": "3"
        },
        {
          "code": "STA102",
          "credits": "3"
        }
      ],
      "semester_2": [],
      "semester_3": []
    },
    "second_year": {
      "semester_1": [],
      "semester_2": [],
      "semester_3": []
    },
    "third_year": {
      "semester_1": [],
      "semester_2": [],
      "semester_3": []
    },
    "fourth_year": {
      "semester_1": [],
      "semester_2": [],
      "semester_3": []
    },
    "year_credits": 35
  },
  "notes": "Course to PO mapping is under revision."
}